{"article_content": " As the only four-year member of the Andover Girls Cross Country, Captain Posie Millett '20 leads with an emphasis on unity and companionship. \nAccording to Millett, she immediately found a source of friendship upon joining the JV team in her Junior year, and has carried those sentiments with her throughout her time in the program.\n\"Coming [Junior] year, cross country was really a place that I felt an immediate sense of kinship on campus... I think that's what makes me able to be a good Captain--doing it for the other girls on the team and really knowing that I'm leading for them,\" Millett said.\nIn an effort to cultivate a positive atmosphere, Millett hosts several team bonding activities and gives advice to her teammates when needed, according to Amelia Vinton '22 and Christina Li '21. \n\"I think what makes Posie such a great captain is her ability to lead and be like an older sister to everyone on the team at the same time. She has a bubbly spirit and is there for you when you need her to be,\" said Vinton.\nLi added, \"Posie also goes out of her way to foster team camaraderie. Twice every day, she is in Lower Right hosting team breakfast and dinner, and during preseason she brought arts and crafts supplies to decorate the girls' cross country meeting area in Snyder.\"\nAs a leader on the team, Millett makes it a goal of hers to ensure every member of the team feels supported and connected.\nMillett said, \"I suppose I'm more of a quiet type of leader. I'm not the loudest person in the room, but I think that making sure that I lead by cheering on the last person who's coming in from the workout, or making sure that everyone gets in from the warmup together, and making sure to talk to other people that I haven't had the chance to get to know yet [is really important].\"\nIn addition to leading by example, Millett's lively persona boosts her teammates' morale and motivates them to compete better, according to Li and Head Coach Rebecca Hession.\n\"She leads practice with her positive attitude and shares her excitement about running with the team. She motivates us to give it our all every day, especially during hard workouts,\" said Li.\nIn an email to The Phillipian, Hession wrote, \"Posie's positive energy is contagious and she has done a fantastic job collaborating with her teammates to lay the groundwork for a strong racing season.\"\nIn addition to her strength in character and as a leader, Millett's passion for long distance makes her a role model for her teammates, according to Hession.\n\"Posie's first race of 2019 demonstrated her strength as a tactical racing. At Bobcat, a very challenging and hilly course, she worked her way up the pack each mile. The patience and confidence to progress over the entire distance is an important asset to the team,\" wrote Hession.\nMillett priotizes pack-running in practice, a technique she hopes will help advance the team's overall placement in meets, according to Li and Millett.\nLi said, \"Posie has been emphasizing pack-running as a team. In this way, we'll be motivated by our teammates running alongside us, so we'll run faster and ultimately end up with a lower team score.\"\nMillett added, \"Cross country is a very individual sport. The only way to push yourself past what you think is possible is with the help of your teammates and knowing that your teammates are going to help carry you to the finish line when you don't think you can do it yourself.\"\nAndover has taught Millett the importance of supporting her teammates no matter what place they are in. Millett's constant support and resilience pushes the team to bounce back from any tough situation. \n\"I think just knowing that for me last season -- I didn't have the best season in terms of results -- and I think that knowing my teammates were there for me to support me no matter how I was doing in the competitions was something really important, and is something that I really try to emanate in my own leadership,\" Millett said.\nIn her last year at Andover, Millett looks to lead the team to a Nepsta Division I title. \n \n", "caption": "Captain Posie Millett ’20 also competes on the Varsity Nordic and Crew teams.", "credit": "S.BAHNASY/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/posie/Compressed_sbahnasy.posie.0001.jpg", "headline": "Girls Cross-Country Captain Posie Millett Teaches Camaraderie and Kinship on the Course", "writer": "Luke Boshar", "categories": "sports,", "more_options": ""}