{"article_content": "\n\nGirls Cross Country Head Coach Rebecca Hession will return to her role on the team after she missed the season last year while on a one-term sabbatical. Last fall, the position was covered by current Boys Cross Country Head Coach Patrick Rielly.\nFirst competing in cross country in middle school, Hession was introduced to the Andover coaching staff in 2006 as the assistant of former Head Coach Nancy Lang '83. Hession looks forward to continuing to foster the strong community of students, coaches, families, alums, fellow competitors, and superfans within the sport.\nAccording to Hession and Natasha Muromcew '22, Hession has especially focused on perfecting the details of the team's workouts this season in order to help improve its overall performance.\n\"Reviewing training logs, designing workouts that align with a runner's growth, thinking about the trajectory of a season and championship races--all those are the details that I love as a coach,\" said Hession.\nMuromcew added, \"She is very involved with cross country and we all know that she puts a lot of time and effort into making the right training plans, telling us important information, and researching courses to help us race our best. It is really the little things that add up and she is one of the main reasons our team is so strong.\"\nAccording to Hession, her break from coaching the sport last year allowed her to build connections and become more motivated heading into the new season.\nHession said, \"I am excited to be back with Girls Cross Country. The break last fall allowed me a bit more time with family and space to expand my running community. The time away only strengthened my belief in the power of team and supportive training partners.\"\nAccording to Muromcew and Captain Posie Millett '20, Hession's constant positivity and inclusive nature inspires the team to follow her hardworking example and push through difficult training. \n\"She is very positive, driven, and hardworking. She always has a smile on her face which inspires us to smile too. She also has very high energy and spreads it to put us in a good mood. She leads by example by helping us do things like active warmup and motivates us to go faster and do our best,\" said Muromcew.\nMillett added, \"One of my favorite things about Coach Hession is that she really makes an effort to get to know each and every person on the team. She really makes it important to her and therefore important to everyone else to make sure that everyone is feeling satisfied with their workout or practice today.\"\nAccording to Millett, Andover Girls Cross Country holds has formed a unique team bond through Hession's new implementation of the pack running mentality in practices.\nMillett said, \"One of Coach Hession's favorite things to emphasize is our practice of pack running. Since cross country is an individual sport, it is easier and better for us to run together during races, so we push each other rather then trying to run by ourselves. I think this practice really makes us a better team and teammates because cross country can sometimes be hard, since you are doing things individually.\"\nHession emphasizes that, although the team abides by the same values and work ethic, each season remains distinctive on account of the new runners and their respective goals within the team. \n\"[Girls Cross Country] trains hard and the positive team culture is fundamental to the program. Every year is different. There has never been a GXC 2019 before now. The program has many strong and valuable traditions, but each season is an opportunity for the team to set new goals and aspirations,\" said Hession. \n", "caption": "Rebecca Hession spent the fall on Sabbatical with her husband, Matthew Hession, Instructor in History", "credit": "A.FUNG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/hession/Compressed_afung.hessionBW.01.jpg", "headline": "Head Coach Rebecca Hession Returns to Girls Cross Country from Sabbatical", "writer": "Nicole Lee", "categories": "sports,girls-cross-country,fall-sports", "more_options": ""}