{"article_content": "On a blank piece of white paper, water with a hint of faint black ink forms a wispy circle. On another piece of paper to the right, the ink making up the circle is darker, with different textures and shades of lines leading to an abstract patterned center. Several similar papers lie side by side, where the black circle eventually transforms into a dark crow, complete with a sharp beak and a similar circular body to the first picture. \nThese ink drawings are just eight of the over 50 pieces that Artist-in-Residence Dr. Aphrodite Navab created over the course of one week and showcased last Friday at an Open Studio that was held in Abbot Hall. The event was held in order to give anyone who wanted to see her art an opportunity to get a glimpse behind the scenes of her process and ideas.\nThese particular eight drawings, which Navab is thinking of calling “Landmines of Memory,” were inspired by the circle of stones next to Gelb Science Center. Navab got her inspiration for all of her art this week from the nature around campus by walking at least six miles every day. Brigitte Leschhorn, Instructor in English, talked about her opinion and interpretation of the paintings.\n“I really like them because I really like the idea that a physical space can become something that’s living— can sort of grow bones and feathers and then become something that’s a mixture of both its space and become something that is alive,” said Leschhorn. \nNaveb was visiting Andover as part of the Edward E. Elson Artist-in-Residence program, in which artists from around the world are flown in to Andover to absorb the culture of campus and work on pieces inspired by the school.\nJamie Gibbons, Head of Education at the Addison, said, “There is no set program... so it can really vary depending on how much time that artist has available, but also what they’re interested in doing. Though they always in some way work with an audience—sometimes they meet with classes [on campus], sometimes they meet with classes from off-campus.”\nNavab decided to accept the Artist-in-Residence invitation for her oldest brother Alexander Navab ’93, who recently passed away this summer and was featured in the exhibit “Men of Steel, Women of Wonder,” which recently opened at the Addison. \n“I just lost my brother, and he went to Andover. He died in July, and they contacted me in August, so they didn’t know, and I said any work of art that I do here would be in honor and memory of my big brother. They were so happy and excited to have this coincidence and this opportunity, and so was I. For me it’s been very healing, therapeutic— it’s also as a little sister sort of retracing the steps of her big brother who inspired me in so many ways,” said Navab. \nNavab’s time walking around Andover served as both the inspiration behind the over fifty pieces she created, and also contributed to a feeling of healing and serenity.\n“I have to say the most inspiring aspects have been really walking and enjoying Andover, coming with my history and my other series, and then noticing things in the landscape because it’s been meditative. The work I’m doing is also quite meditative, even the walking I do is mirrored in the circles I’m drawing and the way I’m going round—I went round and round this campus—physically, viscerally, psychologically, spiritually, emotionally, and artistically, those have been the most significant influences,” said Navab. \n", "caption": "Aphrodite Navab majored in art at Harvard College, and her former professor was in attendance at her lecture at the Addison Gallery of American Art this past Wednesday", "credit": "E..ELLSWEIG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/open_studio/eellsweig.openstudio.jpg", "headline": "Aphrodite Navab Creates Art Inspired by Andover Scenery During her Time as an Artist-in-Residence", "writer": "Natalie Chen", "categories": "arts", "more_options": ""}