{"article_content": "Christopher Capano, Director of Student Activities, has been working in the Student Activities Office (STACT) since the fall of 2010. A notable contributor to Andover student culture, Capano is in charge of planning weekend activities alongside the STACT student board. \nDuring weekly meetings, Capano and the board work together to plan possible future events and reflect on the successes and failures of past ones. One of the board members, Eliza Dow ’22, detailed how Capano maintains a friendly environment where students are safe to express their opinions. \n“Mr. Capano is very receptive to hearing the students’ opinions. Students have a lot of freedom with the opinions and the ideas we come up with… Everybody on the board has a lot of good ideas, but they are also very nice and respectful. We listen to each other’s opinions and come up with our own ideas, and add onto each other,” said Dow. \nCapano varies the activities he plans year to year, depending on the tastes of the student body. This year, the STACT board will focus on planning more field trips. He asserted that Student Activities will hopefully plan more off-campus events, such as Boston trips, a trip to Salem for Halloween, or more shopping and beach trips.\n“I think we need to give people something to do. Students here work really hard, they have tons of homework, they take hard classes, and are really into sports. We have awesome students, so I think we need to give them a fun, safe outlet to do some stuff on the weekends and blow off steam while having fun. My goal is that our events are fun and well-attended,” said Capano. \nAccording to Capano, his favorite events are ones where the student body showcase their many talents, such as Coffeehouse and Open Mic Night. Another board member, Su Chermayeff ’21,  added that Capano also attends many of the events he plans, both to chaperone and to spend time with students. \n“Mr. Capano plays a pivotal role in student activities. He is at every meeting and is there for every activity that we plan. Yesterday during the mall trip, he was there and made sure that we were all ok, safe, and having fun. Mr. Capano is so kind and never hesitates to join in on the fun activities that we plan,” said Chermayeff.  \nSTACT board member Kam Saalfrank ’21 asserted that Capano’s easy-going personality plays a big role in his ability to plan entertaining events. Saalfrank elaborated on this by explaining that Capano is genuinely interested in how students are doing and wants to get to know them.\n“I think that he has a desire to get students out of their dorms and doing something fun on Friday and Saturday nights, and what exactly that is comes from his lively personality. He has a good sense of how to balance weekend activities so it doesn’t feel like the only thing happening over the course of a month are dances every single weekend or off-campus trips every single weekend,” said Saalfrank.\nOne part of the job for Christopher Capano, Director of Student Activities, is welcoming the newly chosen Blue Key Heads in his home, Burtt House. According to Blue Key Head and Student Activities (STACT) board member Jed Heald ’20, being selected as a Blue Key Head was a special moment for him, and one that he was happy to share with Capano. \n“My favorite memory with Mr. Capano was last spring when I became a Blue Key Head…  Capano always brings high energy and thoughtful ideas to [STACT] meetings each week. [He] is the best when it comes to planning activities each and every week and we wouldn’t want to do it with anybody else. Capano is always on top of his game with scheduling and helping us bring the ideas we have in meetings to fruition and carrying them out,” said Heald.\n", "caption": "According to Christopher Capano, dances were almost exclusively the only weekend events offered when he arrived at Andover in 2000.", "credit": "E. QI/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/capano/Compressed_eqi.CAPANO.jpg", "headline": "Students Reflect On Memories with Student Activities Director Christopher Capano", "writer": "Natalie Chen, Noemi Elliott", "categories": "arts", "more_options": ""}