{"article_content": "With a squash racket in hand, Charlotte Whitehurst ’22 strummed her fingers against her makeshift guitar to the beat of “Love Story” by Taylor Swift as Ash Cohan ’20 held a microphone. Throughout their performance, Whitehurst and Cohan lip-synced lyrics of the song. When Swift sang “marry me Juliet,” Whitehurst got down on one knee and acted out a marriage proposal as the audience cheered and laughed. \nThis past Saturday evening, Open Mic Night Meets Lip Sync Battle was held in Susie’s, with acts ranging from spontaneous lip-syncing to a prepared piano solo. Audience member Nick Gibeley ’22 said, “I absolutely loved [Whitehurst and Cohan’s] performance. “Love Story” is such a great throwback song to our childhoods, and I also loved how Charlotte used the racket as a guitar as it brought both a carefree and lighthearted mood to the evening.”\nThe two emcees, Lilly Feeney ’20 and Hywot Ayana ’20, shuffled around Susie’s, encouraging students to perform impromptu and announcing participants. Ayana, alongside partner Chioma Ugwonali ’20, was the first to take the stage, lip syncing to “Truth Hurts” by Lizzo.\nAyana said, “I chose to participate because I wanted to get other people involved. Getting up on stage and performing in front of your peers can be hard, so I wanted to go first to at least break that ice. I'm not good at singing or dancing, but I wanted to help make other people feel more comfortable getting on stage.”\nThe second act of the night, featuring Amelia Meyer ’21 and her prefectees Zadie Rutty-Turner ’23 and Aleena Kibria ’23, took to the stage wearing colorful sunglasses as Meyer moonwalked across the stage while lip syncing to “All I Want For Christmas Is You” by Mariah Carey.\nMeyer said, “Our dorm, Draper [Cottage], had a collective dorm performance tonight. Every single night, we end up screaming and dancing, and “All I Want For Christmas” is one of our favorites. Tonight’s [lip syncing battle was] a great way to show dorm spirit and de-stress. Dance and music are so powerful and there’s a lot of humor with it.”\nEmma Jing ’22 and Emily Smith ’22 lip-synced to “Breaking Free” from High School Musical. While dancing around the stage, the audience turned their phone flashlights on and waved them back and forth. According to Jing, their song choice was spontaneous and fun.\n“We chose [‘Breaking Free’] as a throwback to our childhoods. We all watched ‘High School Musical’ when we were younger, so we wanted a song we both knew and that the crowd could sing along to and enjoy,” said Jing. “Be brave and go up there, because no one’s going to make fun of your performance, so you should enjoy yourself a little and bring a friend if you feel really nervous.” \n", "caption": "Amelia Meyer ’21, Zadie Rutty-Turner ’23, and Aleena Kibria ’23 (From left to right) captured the stage by lip syncing to “All I Want for Christmas.”", "credit": "D. ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/openmic/Compressed_dzhu.openmic.0001.jpg", "headline": "Open Mic Night Meets Lip Sync Battle Features Spontaneous Performances", "writer": "Noemi Elliott", "categories": "arts", "more_options": ""}