{"article_content": "Playing competitive club soccer since the age of 12, Co-Captain David Wang ’20 joined Andover Boys Soccer as a new Upper and was voted Co-Captain after just one year on the team.\n“I started playing soccer when I was six years old and it began just as a Sunday gathering with people in my neighborhood. At a young age I think I was pretty good at the sport even though I wasn’t that technical. I was quite fast, so it made me want to continue. My parents saw my potential and pushed me into a more competitive league. I continued playing without complaints and the more I did, I began to really enjoy the sport,” said Wang. \nAccording to Head Coach Edwin Escobar and Co-Captain Connor Ding ’20, upon coming to the team, Wang instantly found his place and displayed leadership through his work ethic and dedication.\n“When David came to the team, right off the bat you knew that he was going to be a Captain his Senior year. His work rate is absolutely one of the best that I have seen in my time working here. I think that it was quite evident and I don’t think it was a surprise for anybody that was voted Captain just because he was so motivated and determined when he came in,” said Escobar. \nDing said, “He has a really good work ethic and always shows up to practices ready to give it his all. I think David really adapted to the team very quickly and I don’t think of him as a one-year player. It seems like he’s been here the whole time. He’s really fun to work with and I think he really showed last season why he deserved to be Captain.”\nAs both a skilled player and communicator on the field, Wang’s athleticism has led him to be crucial to the team’s success, according to Alan Fang ’21 and Escobar.\n“I think David brings the team together just by constantly talking and giving directions in games and matches. You can always hear him on the field and [he] will always be saying something to help us improve. In practice we play a lot of scrimmages and David will be communicating to both teams even though we are competing, he gives direction to both sides. He is constantly talking, always communicating, and lets us know what we need to do,” said Fang. \nEscobar said, “David is a very gifted athlete and he is also very skilled. I would say he is our most skilled player on the field and while he is all that, he is one of the most humble guys that you can find out there on the field.”\nWang’s presence both on and off the field is key to the team’s bond, according to Ethan Hong ’22 and Escobar.\n“David is definitely a people person which really helps the team’s chemistry as a whole. He plays a major part in the team and really is the glue that brings us all together,” said Hong.\nEscobar added, “There are a lot of things that go on off the field, and I think he is now a lot more aware of that and now is a lot more aware of the different personalities that are on the team and what kind of leader he needs to be to connect with everyone.”\nAccording to Wang, being Captain has been rewarding, as he strives to lead by example in both practices and games.\n“It is always nice to represent your school and especially being the Captain of the Varsity team this year, it is great to be able to lead a pretty competitive team. It was really rewarding that my teammates respected my hard work, passion, and talent for the game,” said Wang.\nWang hopes the team will be able to reach the Nepsac playoffs and perform to the best of its ability.\nWang said, “I hope to make the playoffs this year, just like it is the goal for many other teams, and to just keep pushing, because I think we have a good chance of performing really well this year in the championships, given the way we have been playing.” \n", "caption": "Co-Captain David Wang ’ 20 committed to Williams College last July for soccer.", "credit": "E..ELLSWEIG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/david/Compressed_IMG_2104eellsweig.david.jpg", "headline": "Co-Captain David Wang ’20 is the “Glue that Brings the Team Together”", "writer": "Nicole Lee", "categories": "sports,", "more_options": ""}