{"article_content": "\n\nEntering his third season of coaching at Andover, Head Coach Edwin Escobar wants his players to enjoy the game and learn how to overcome adverse situations. According to goalkeeper Phineas Walsh ’21, Escobar has cultivated a team with a balanced dynamic. \n\n\nWalsh said, “Escobar has built a really strong culture within the team. He’s been able to win the respect and likeness of his players while grooming a locker room full of guys ready to go 100 percent for him.”\n\n\nEscobar played soccer in South America until he was ten years old; during these early years, his father was his coach. He went on to play soccer in the United States, and compteted at the high-school level in Massachusetts and at the collegiate level as a Co-Captain of his team at Middlebury College. His coaching career began at Tabor Academy and after nine years there, he came to Andover in 2016. \nWhat is your background in soccer as a player and a coach?\nMy dad is from Colombia and the love of the game comes from there. I grew up watching my father play. At a very young age, I learned to associate soccer with friendships. Where I'm from, hanging out is playing soccer...I played a little bit in Florida at the youth level... I played a little bit in Connecticut out there again in [my] youth. Then I went to a small high school in Western Massachusetts...I got [to play] there with a group of good player, [and] that opened up the opportunity to go to college and play at the college level… After that, I ended up coaching at Tabor Academy and there I was able to coach the girls varsity soccer team, [and] I was also able to coach the Boys Varsity Soccer team, [and] the JV programs there. Eventually nine years after working there, I ended up here at Andover, a place that I had for a long time looked into and hoped that one day I'd have the opportunity to work with the program.\nWhat soccer player do you look up to?\nI think I admire Ronaldinho, [former player for Paris Saint-Germain, Barcelona, and A.C. Milan]. Ronaldinho is not the most popular name today [and] will be one of those names that will be forgotten, but I think the game of soccer, it's supposed to be fun. He played it with a smile on his face, and that's what it should be all about. He won everything as a player and I think I attribute a lot of his success to the positive energy that he brought to the National Team that he played for and to the clubs that he played for. He won it all. \nWhat makes you passionate about soccer?\nI think what motivates me is that the way that I view the game. I view it as an opportunity for you to bring a group of players together...How can I cultivate, how can I develop an environment where players feel that they are playing with more than just teammates? More like a family?\nWhat makes your coaching style different from most coaches?\nI’m a pretty demanding coach, and the reason that I’m demanding is because I strongly believe in the players that we have out there. They know each day that I’m going to demand high energy from them and more than anything, I want them to demand the best of themselves… I think that, if they were to describe how I am as a coach, I would hope that it is somewhere along those lines.\nWhat is your favorite memory as a coach at Andover?\n[My] favorite memory would probably have to be a particular game… Probably last year’s game against Exeter. I always love the crowd, always love the support of those who come out to watch us play. Watching Owen Glover [’19]  collect the assist in that game after battling a lot of injuries throughout his career here was really a special moment for me. It was just right for him to end his high school career here on a positive note… He had to overcome a lot to be there at that moment, to get that assist in a big game like that. So to see the smile on his face was great.\nHow is the team looking this year?\nI think we are… as strong as we have been since I have been here. I think we have great leadership in [Co-Captain] Connor Ding [’20] and [Co-Captain] David Wang [’20]. They are very passionate about the sport and they are very demanding of their teammates and they lead by example. It has taken a little bit of time to get this group of players together and for them to know how to operate, [and] to work at the level at the level that they are working right now. \n\n\n", "img_path": "nophoto", "headline": "Edwin Escobar Focuses on Creating a Close Knit Team in his Third Season as Head Coach", "writer": "Charlie Ferguson", "categories": "sports,", "more_options": ""}