{"article_content": "Occupants have reported various ghost sightings, unexplained occurrences, and human-like screaming for several years in Stimson House, according to Piper Drew ’20. Her Lower year, Drew claims to have seen a ghost standing over her bed.\n“Technically, it was April 1, 12:13 a.m. I do remember looking at the clock. I was in my bed trying to fall asleep and I rolled over and at the foot of my bed, there was a woman standing there. She was in this long white dress and her arms were outstretched and in her hands she held what I best can describe as a ball of wire, almost, that had a light radiating from it. I promptly screamed and she disappeared,” said Drew. \nThe night after the incident, Drew used string lights to provide some light to her room and they were turned on before she fell asleep. When Drew woke up, however, the lights were switched off. Drew attributed this to the ghost in her room.\n“So either someone snuck into my room and switched them from on to off, but what I like to believe is that a ghost had flicked it off. So the following evening, the rest of my hallmates [and I] gathered in the common room of our three-room double and held a seance. This one girl found something online, some incantation to recite to get rid of the ghost and we had candles, we all held hands and we said the incantation. I haven't had a ghost problem since then, but for safety reasons, I bought a container of salt and salted my doorsteps and my window sills to try to keep the evil spirits out,” said Drew. \nAccording to Drew, multiple Stimson alumni have also reported altercations with ghosts. One account described a woman similar to the one that Drew saw, and another saw a child in the Stimson basement.\n“I have heard a similar story to mine from a Senior who told me that the previous year, they had also had seen a woman in the Annex, which is where I live. When she described it, it sounded pretty similar to what I had seen so I like to think it was a ghost. I also do believe in ghosts,” said Drew. \nA couple of weeks ago, Alyssa Muffaletto ’21 noticed an unusual circumstance; her touch-sensitive lamp turned on by itself halfway through the night. Although she does not attribute this to paranormal activity, Muffaletto does not know what caused her light to turn on. \nMuffaletto said, “I have a lamp that's activated by touch only across the room from my bed, and I turned it off because the lightbulb is way too bright to be able to sleep while it's on. I also locked my door before I went to sleep. And [when] I woke up it was on and facing my bed, but usually it's facing the ground or my desk. It was a very weird circumstance because I didn't get up and turn it on. It was just on at 6:00 a.m. for no reason and the door was still locked. I don't know what happened.”\nMareesa Miles, a house counselor in Stimson and Teaching Fellow in English, believes that this paranormal activity makes sense due to Henry L. Stimson’s involvement in the Manhattan Project during World War II, an undertaking that eventually resulted in the first nuclear weapons. \n“I feel like Stimson probably has a ghost problem due to the fact [that] we're next to a graveyard. Our address is 13 Chapel Ave, and Henry L. Stimson wasn't a great guy, so it's like karma or something that leaves ghosts in this dorm. There's totally a possibility of other Knoll dorms being haunted just because of the location and also the [Cochran Bird] Sanctuary's sort of creepy,” said Drew.\nNicholas Zufelt, a house counselor in Stimson and Instructor in Mathematics, Statistics, & Computer Science, gave a possible explanation to the paranormal experiences by referencing the way sounds carry in Stimson. Additionally, he noted that, because Stimson is rumored to be a fallout shelter, it could be paranormal. \n“I am very new to being in a girl’s dorm so I’m trying my best not to panic when I hear sounds. I’m typically not awake at 1:00 a.m., and I am a heavy sleeper so I wouldn’t have heard [anything]. I am thinking that the sounds in this dorm carry in very weird ways because there are literal holes in the floor that go all the way up and down everywhere from all the vents and stuff,” said Zufelt. \nZufelt continued, “There are also some crazy huge pipes. If you go to the garage, the pipes are ridiculously huge for there only being 40 people in this dorm. It looks like they could supply hundreds of people. I’m not a plumber, [but] that would be my guess — that the sounds carry very weirdly in this building because of all the holes in the walls and [the] massive pipes. That could be an explanation.”\n", "caption": "Stimson House’s purported ghost problem has often been attributed either to its proximity to the graveyard or the legacy of its namesake, Henry L. Stimson.", "credit": "P.HOTO-ILLUSTRATION BY V.FAN AND R.HALTMAIER/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/news/stim/Compressed_vfan.stim.photoillustration.rhaltmaier.jpg", "headline": "That’s The Spirit: Haunted Activities Reported in Stimson", "writer": "Laura Ospina", "categories": "news,featured", "more_options": "--post_date='2019-10-19 16:06:44'"}