{"article_content": "An investment manager, playwright, and benefactor of the health care institution Henry Street Settlement, Richard Abrons '44 bettered the world in many different ways. He devoted his life to making others happy, according to his online blog. On Monday, September 16, Abrons passed away at the age of 92 due to kidney failure. \nAccording to the 1944 Pot Pourri yearbook, Abrons went by the nicknames \"Abe,\" \"Abner,\" and \"Dick\" while at Andover. He was on Varsity Andover Boys Tennis all four years and a member of All-Club Wrestling his Senior year. After graduating from Andover in 1944, Abrons pursued a career as an investment manager by forming First Manhattan Money Management in 1964.\nBesides finance, Abrons dedicated his life to campaigning for social justice. He was a board member of the Henry Street Settlement for 52 years, an agency on the Lower East Side of New York City that mitigates the ramifications of urban poverty by providing a range of social support initiatives to more than 50,000 New Yorkers. \nThrough the Henry Street Settlement, Abrons furthered arts classes in New York and launched health services for the homeless. His children, sister, and brother created a fund in the settlement that imparted 530 low-income students with more than 500,000 dollars in college scholarships since 1998, according to \"The New York Times.\"\nChristy Wei '21 reflected on Abrons's legacy of Non Sibi throughout his life, tracing it back to his time at Andover. She explained how she felt inspired by Abrons to further exemplify Non Sibi. \n\"I think it's great as an Andover student to see how all the alumni before you have carried through the Non Sibi throughout their lifetimes. It's important and very inspiring to know that just four years of high school can really influence you for a lifetime. And this makes me feel like I should try to learn and gain more from my Andover experience, to make the most out of it, so that it will influence me over my lifetime,\" said Wei.\nIn addition, Abrons was a creator and a writer, pursuing playwriting and publishing over two dozen short stories. One of these short stories, \"Every Day a Visitor,\" was featured in the North American Review and won the National Magazine Fiction Award in 1981. It was adapted into a play by the New Federal Theater company in 2001.\nAbrons continued writing until the end of his life, contributing semi-regular blog posts as a Huffington Post contributor. In a blog post titled \"Make Someone Happy,\" published on July 20, 2016, Abrons mused about his upcoming 90th birthday party and described how, while he hadn't quite uncovered the secret to life, he had approached it listening to a cover of \"Make Someone Happy\" by Jimmy Durante. While listening to that song, he determined that what made him happy was making others happy. \n\"It is well known that Albert Einstein searched for a unified theory that would explain everything. He never found it. What is not known is that I, too, have been searching for a unified theory. Not in physics, of course. I almost flunked that at Andover. No, a unified theory that would explain our lives--what drives us, what halts us--you know--everything. I have not found it either. But I have come close, listening to the song 'Make Someone Happy' as sung by Jimmy Durante...you can hear Jimmy belt it out on YouTube. I strongly advise you to do this,\" wrote Abrons. \nAbrons continued, \"In November I am throwing myself a 90th birthday party. I am going to invite the people who have made me happy down the avenues I've traveled--family, schools, sports, work, theatre, Henry Street, community gardens, Bronx Children's Museum, old friends, new friends. Some of you will only know one or two others there, maybe just me. Well, you belong there. You make me happy. I hope I make you happy too.\"  \n", "caption": "In addition to his service work, Richard Abrons ’44 published short stories.", "credit": "COURTESY OF POT POURRI", "img_path": "/home/plipdigital/wp-photos/9-20/news/abrons/abrons.jpg", "headline": "Richard Abrons '44, Philanthropist and Playwright, Dies at 92", "writer": "Sophia Lee and Sophia Hlavaty", "categories": "news,featured", "more_options": "--post_date='2019-09-20 14:28:07'"}