{"article_content": "Students gathered in the Community and Multicultural Development (CAMD) office scrambled to come up with the title of the song being played as part of the \"Name That Song\" game during Af-Lat-Am's annual mixer. Songs like \"My Boo\" by Ghost Town DJs, \"Ready or Not\" by The Fugees, and \"Buy You a Drank\" by T-Pain were among those played as part of the game, which aimed to help students meet and bond.\nAf-Lat-Am co-president Abby Ndikum '20 said, \"In the beginning, we played 'Name That Song' because we wanted everyone to participate in an icebreaker that would promote member bonding. Throughout history, music has played an essential element to both the black and Latinx communities, so the [Af-Lat-Am] board believed that by incorporating this game, we could share a small piece of each culture to the broader community.\"\nThe mixer was held in CAMD last Friday evening. According to Araba Aidoo '20, fellow co-president of Af-Lat-Am and organizer of the event, the purpose of the mixer was to meet new students, incorporate them into the group, and welcome back returning students. \n\"We want new students to feel like this is their go-to place, like this is the place where they can feel like they belong. When they're having trouble, or feeling lonely, they can find someone in Af-Lat-Am and know that they will listen and talk to them. For a returning student, we want them to find the leader within themselves... and share their experiences and wisdom [with new students],\" said Aidoo. \nIn addition to the games, students ate food and talked amongst each other, allowing new and returning students to forge connections and build trust. Along with the opening \"Name That Song\" game, participant Izunna Obiora '22 said that the annual \"Either/Or\" game was the highlight of his first mixer the previous year, and something that he looked forward to this year. Questions such as \"Pepsi vs. Coke?\" or \"East Coast vs. West Coast?\" encouraged participants to express their opinions. \n\"'Either/Or' ... [ was] definitely the most memorable part of the mixer last year. It always gets very loud and active. I enjoy being in a community where there is enough respect and trust that we can be free to voice our opinions, even if they may be different,\" said Obiora. \nThe Af-Lat-Am mixer also provided a space for new students to meet older and returning students. Paulkichna Merove '22, a new Lower, expressed how welcoming the returning members of Af-Lat-Am were to her and explained the importance of joining a safe community and the sense of belonging it helped create for her. \nMerove said, \"They are very welcoming here. As I was walking in, Layomi [Oloritun '20] came out of nowhere and greeted me. I think it's important as a black student to be surrounded by others like you... and makes you feel like you're part of a community. As a black student in a predominantly white space, these sort of spaces are important to be a part of.\"\n", "caption": "Students played “Name that Song,” during last Friday’s Af-Lat-Am Mixer, establishing connections with each other.", "credit": "courtesy of ms.springer", "img_path": "/home/plipdigital/wp-photos/9-20/arts/aflatam/Compressed_courtesyofarabaaidoo.01.jpg", "headline": "Af-Lat-Am Mixer Brings Together New and Returning Students to Forge Friendships", "writer": "noemi elliott", "categories": "arts", "more_options": ""}