{"article_content": "\n\nAround 130 middle and high school students from the New England area flocked to the Microsoft Burlington Office in Burlington, Mass., for the third Hack New England High Schools (HackNEHS) hackathon Saturday. The event was organized by Anthony Kim ’21, Jeffrey Pan ’21, and Alex Turk ’21.\nThe day-long event consisted of keynote speakers, team projects, workshops, and a Q&A panel with professionals. According to Pan, the goal of the hackathon was to meet other students with a  shared interest in technology. Pan, Kim, and Turk first became close at the 2017 hackathon, and inspired by their own passion for technology, decided to host it again.\n“I didn't know either Anthony or Alex very well, but through that event we kind of got to know each other and our shared interest for technology. It formed this kind of special friend group that I'm in now, so I [felt] that I wanted to share that experience with the broader New England community,” said Pan.\nLauren Lee ’22 attended the event with no prior coding experience and enjoyed the welcoming environment. Lee saw the hackathon as an opportunity to meet new people and learn about coding.\n“Honestly it was just really cool that you could go there and learn things. It was a really cool environment just to meet new people and to take classes and it didn't seem that judgemental about not knowing anything,” said Lee.\nAlex Pedroza ’20 was hesitant to sign up for the event because she had minimal coding experience, but found it empowering to uncover the connection between coding and real world problems. \n“Going to these seminars kind of gave me an idea of practical uses to some of the languages that are available to learn. So, although they did go very fast and I did get lost at a couple of points it was really helpful to know how I could use these other resources that they were presenting to supplement my knowledge of computer science,” said Pedroza.\nFor the competition rounds, groups of four created projects that were judged by a panel at the end of the event. Some projects included a photo vault app disguised as a calculator and a calendar organization app that coordinates events with email. \nThe winning team designed an app that provides information about the threat of the Eastern equine encephalitis (EEE) virus. According to Michael Barker, Director of Academy Research, Information, & Library Services, this project was relevant to surrounding communities, one component of the grading criteria.        \n“The winning project was an app that gauged moisture and humidity in the air and could kind of alert you to EEE. It speaks not only to the life here at Andover, but clearly it's on the mind of other high school students,” said Barker.\nLast spring, Kim, Pan, and Turk applied for an Abbot Grant from the Abbot Academy Fund to support this year’s hackathon, as well as the program’s future. Over the summer, the organizers reached out to other sponsors that allowed the hackathon to host speakers, award prizes, and access a venue.\n“Our biggest sponsor was probably the Abbot Academy Fund, and then beyond that we were really just reaching out to anyone and everyone who [would be] willing to sponsor this hackathon. Anyone who kind of thought that we were doing something that was good for the community and who felt that their company was in the spirit of HackNEHS,” said Turk.\nIn the future, Barker hopes to diversify the hackathon for more students who are interested in topics beyond computer science. Barker also looks to change the format of the hackathon.\nBarker said, “We need a more diverse set of students willing to coordinate these things. I would love it if the students that plan these things weren't just computer science students… We need artists and students that wouldn't ordinarily think of themselves as people for hackathons. Certainly by gender, race, class, perspective, I would love to just really have a mix.”\nWhile Pan found the process of organizing the hackathon to be demanding, he looks forward to leading the event again next year.\n“I'd say it was an incredibly tiring, but very rewarding experience. Overall, I think we're all glad this happened, and we're hoping to do it again next year,” said Pan.\nEditor’s Note: Anthony Kim is a Digital Editor for The Phillipian. Jeffrey Pan and Alex Turk are Associate Digital Editors for The Phillipian. \n", "img_path": "nophoto", "headline": "Andover Students Lead Third HackNEHS Hackathon", "writer": "Hannah Justicz", "categories": "news,featured", "more_options": "--post_date='2019-10-20 00:49:53'"}