{"article_content": "When the Fenton family first adopted Yukon, their Golden Retriever, he would prance around in the snow, his underside caked with frost. Yukon, named after Yukon Cornelius from the 1964 movie “Rudolph the Red-Nosed Reindeer,” has been a part of the Fenton family for around ten years[a]. They decided to name him Yukon because he was born on Christmas Day.\nMartha Fenton ’83, West Quad North Cluster Dean and Instructor in Athletics, lives on campus with her children and two dogs, Yukon and Charlie, another Golden Retriever.\nAidan Fenton ’23 said, “When I was five, I brought Yukon in for show and tell, and all the students were really excited to have a puppy in the classroom… I remember having all the kids on the rug, and I was sitting in a rocking chair with Yukon. He was about 15 pounds or even lighter, and I remember bringing him out onto the playground afterward and going down the slide with him.”\nCharlie, short for Charlotte, joined in the spring of 2019. Martha recalled some of her favorite memories with her dogs, highlighting when Charlie first learned to swim over this past summer. \n“We live in Essex in the summertime and [we watch Charlie and Yukon] play in the sandbars in Essex. They both love the water. Charlie learned to swim there. She initially wasn’t so sure, but watching her grow in confidence and play in the water over the summer has been great,” said Fenton.\nYukon and Charlie are usually situated outside Paresky Commons during meal times, where students and faculty members often take a minute or two to sit down and pet them. Posie Millett ’20 described the importance of pets and how they allow students to unwind from a long day of classes.  \n“When Ms. Fenton comes into [Bancroft House] and brings Yukon or Charlie with her, it really brings the energy up. Both Charlie and Yukon remind me of home, and to have a presence on campus that is a very pure form of excitement and joy is important… When I am with [Charlie and Yukon], it’s great to take a break from my day and enjoy part of life that isn’t centered around school or academics,” said Millet.\nAccording to Fenton, campus pets are an important part of student’s lives and are therapeutic, bringing a sense of normalcy and lightness.\n“My favorite interaction between Charlie and Yukon and the student body has been seeing people light up when they interact with them. A lot of students have pets at home and miss them while they’re away, so knowing my dogs can give them that sense of comfort and fun has always been great to watch,” said Fenton. \nKennedy Smith ’22 agrees with Fenton, and was happy to see the dogs visit her soccer practice. \nShe said, “Ms. Fenton once brought Charlie and Yukon to our soccer practice. The whole team got distracted because we all wanted to pet them. I think having pets on campus is great because they are stress relievers and they create a sense of community within campus and between faculty and students.”\n", "caption": "Last year, Yukon even helped with a Promposal, which turned out to be a success!", "credit": "D. OWYANG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/petofthemonth/Compressed__DSC8989.JPG", "headline": "Pets on Campus: Charlie and Yukon Create Sense of Home in School Environment", "writer": "Noemi Elliott", "categories": "arts", "more_options": ""}