{"article_content": "Following an assist from Nicola Sommers PG’20, Karoline Conte ’21 tipped the ball into the net during the first half against St. Paul’s, tying the game at 1-1. Isobel Glass ’21 widened the gap by scoring again during the second half. Andover Girls Soccer won the game with a score of 2-1, securing Head Coach Lisa Joel’s 200th win. \nAndover went on to compete against Governor’s on Wednesday and came out on top with a score of 3-1, extending the team’s undefeated record to 9-0-3. \nDespite the early goal St. Paul’s scored, the team was able to regain composure, according to Glass and Mack Lucas ’20. \n“I think that overall it was a well-fought game. We proved to ourselves that we can come back after going down a goal, and we can not only tie the game but win the game, which I think was awesome,” said Glass. \nLucas said, “I think in the beginning we got very caught off guard [with] their style of playing which is very ‘kick and run,’ and I think we had a hard time settling down in the first half, and by the second half we got a lot of mistakes fixed and it got a lot better.”\nIn addition to the team’s having to come back from behind, it also dealt with numerous challenges, specifically having a Friday night time slot rather than the usual afternoon games.\nAccording to Lucas, “I think having the Friday night game totally made a difference. We were tired, it was an away game, we were late, [there were] a lot of different variables going on that we were not used to, and we also had to come from behind because they scored 20 minutes into the first half.”\nHowever, some players such as Bella DiBenedetto ’20, Emily Hardy ’20, and Lucas, who was named Player of the Game, stepped up despite the challenges the team had to face. \n“I think Bella DiBenedetto played a really great game. We had a rough time keeping our midfield organized and finding our midfielders feet. She's always a player who can find the gaps, and even if we can't find her feet, she's always in that space to receive the ball, so I think she did a good job consistently finding that space. Our goalie, Emily Hardy, she had a really good save too. Every time she saves the ball it's like, ‘Wait, how did she do that?’” said Lucas. \nGlass said, “I think all of us would agree that [Lucas] had a really strong game. She was just reliable and performed really well along with Nicola in the midfield, which created a lot of chances. I think there were numerous one on ones that Mack had to defend and take care of sometimes by herself.” \nAgainst Governor’s, Andover demonstrated its ability to adjust for the specific playing styles of the different teams, according to Emily Kelly ’22. \n“It was a really hard game, so they really showed how well they played. We had a bad [referee] and we had to make do with what we had, but overall, we played well. It was aggressive, the team was very dirty, so we had to adjust to make sure that everything was safe,” said Kelly. \nAs well as displaying its adaptability, Andover showed improvement and reached new milestones together as a team, according to Kelly. \nKelly continued, “Mary Stuart Kerrigan [’22] got player of the game [against Governor’s], but there were so many other players who played so well too. I think Karoline Conte did really well, as well as Isobel Glass, and Lily Haik [’22] also got her first goal of the season. Lily's goal was amazing.”\nAndover will host Northfield Mount Hermon on Saturday at Graves Field. \n", "caption": "Defender Athalia Esty ’22 also is a member of the Girls Track team, and was part of the Nepsta championship-winning 4x100 meter relay team.", "credit": "D. ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/gvs/dzhu.gvs.002.jpg", "headline": "GVS Remains Undefeated, Achieves 200th Win under Head Coach Lisa Joel", "writer": "Christine Michael", "categories": "sports,,featured", "more_options": "--post_date='2019-10-20 00:50:10'"}