{"article_content": "Receiving the set, Co-Captain Chioma Ugwonali '20 jumped up as middle hitter and spiked the ball across the net to secure the match-winning point during the fifth set against Taft to win 3-2 on Saturday. Andover Girls Volleyball continued their winning streak against Hotchkiss with a 3-0 win Saturday.\nIn the second set against Taft, two Andover players, Violet Enes '21 and Adaeze Izuegbunam '20, suffered injuries, causing the team to make three lineup changes. Andover eventually rebuilt its momentum and came back to win, which shows the team's resiliency, according to Head Coach Clyfe Beckwith.\nDuring both games on Saturday, the team sought to improve its communication and incorporate the playing styles of new team members, according to Coach Beckwith and Brooklyn Wirt '21. \nBeckwith wrote in an email to The Phillipian, \"At the beginning of each season, the most important aspect is establishing good chemistry on the court, a rhythm, trust, adjustments to players' strengths developed or lost since last season, and we are making good strides to that effect.\"\nWirt added, \"I think definitely what we've been working on is persistence and making sure that we talk and we keep the ball off the floor. That's the point of the game but making sure that we're communicating and everyone's just doing their job. The whole team just works better that way,\" said Wirt. \nAndover's offensive players especially stood out this weekend with their powerful hits and strategic playing, according to Wirt. \n\"Sascha [Evans '21] has definitely come into her own and she's been playing awesome. She's been swinging so hard, making really smart plays... Our middles, Chioma and Adaeze, are always really [standout] players and they're always doing a lot for us,\" said Wirt.\nThe team's success this past week stemmed from both Coach Beckwith and the captains, according to Ugwonali and Wirt.\n\"I love Coach Beckwith. This is my fourth year playing under his guidance and he's such a nice guy, but he also knows when to be tough on us. And he looks to us captains to be teachers as well, and I appreciate that because although it seems as if 'Captain' is just a title that some people have, it's actually a responsibility,\" said Ugnowali. \nWirt added, \"Our captains have been working really hard trying to figure out what to say at what times to motivate individuals because that's something that's really difficult with teams because you're not always going to have the same motivation for every person on the team. I think that our captains are working really hard to make sure that everyone has what they need to be the best player that they need to be.\"\nLater in the week, the team also bested Central Catholic 3-0 in a scrimmage and played a game against the newly-formed Brooks team to win 3-0 on Wednesday. The team's record now stands at 4-0.\nAndover looks to remain unbeaten when it plays Loomis Chaffee at home this Saturday.\nEditor's Note: Brooklyn Wirt '21 is an Associate Digital Editor for The Phillipian.\n", "caption": "Following two Andover players becoming injured, the team shifted to a new lineup and rebounded to defeat Taft.", "credit": "C.WAGGONER/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/vball/Compressed_cwaggoner.vbbl.04.jpg", "headline": "Andover Remains Undefeated Through Four Games", "writer": "Luke Boshar", "categories": "sports,", "more_options": ""}