{"article_content": "\n\nThe second edition of Math Open at Andover (MOAA), an annual mathematics competition for middle schoolers, took place on Saturday. This year’s competition, which took place in Kemper Auditorium and Morse Hall, hosted 28 teams composed of 146 students. \nThe tournament directors for this year’s competition were Sebastian Zhu ’20, Victoria Zhang ’20, Vincent Fan ’20, and Max Tao ’20, and the program coordinators were Rachel Chang ’20 and Christina Li ’21. Zhang explained the process of organizing the event. \n“[The planning of MOAA] is a very detailed, multifaceted process, and we have to consider problems that we are going to be writing as well as what type of problems and how many different rounds of competitions we will be having,” said Zhang.\nThroughout the day, the students competed in four different individual and team exhibitions: the speed round, accuracy round, team round, and the Gunga Bowl, in which teams raced to complete 24 questions in 90 minutes.\nMOAA also featured a presentation by Dr. Po-Shen Loh, who coaches the United States International Math Olympiad team. Expii, an educational website founded by Loh, was a sponsor of the event and provided the prizes.\nAccording to MOAA’s website, the goal of the competition is to promote mathematical exploration in a productive and inclusive environment. Zhang emphasized MOAA’s openness to participants from all levels of mathematical expertise. \n“I think it’s very exciting because the way we organize it is that it is accessible to students of all levels, regardless of their grade level, regardless of their background, and also what I think is especially special is that it is hosted by [Andover], one of the best high schools in the country, which shows them that you don’t have to be a mathematical genius to do anything here. This school is open to students of all backgrounds, of all capabilities, and I think that’s really special,” said Zhang.\nLi feels a special connection to math competitions like MOAA, having participated in several of them during her middle school career. She enjoys promoting younger students’ interest in mathematics.\n“I got my start in competition math in middle school, so it means a lot to me to help organize this event. I love being able to further middle schoolers’ passion for math because I know that if I were a middle schooler I would've loved going to a conference like this, especially at Andover because it is such an excellent school,” said Li. \nMOAA was organized in conjunction with the Math Department and Khiem DoBa, Instructor in Mathematics, Statistics, and Computer Science, and faculty advisor to MOAA. Zhang expressed her gratitude for DoBa and the Math Department’s support of MOAA. \nZhang said, “The entire math department has been very instrumental because they have been very supportive of the work we’ve been doing. So even if faculty are not physically present with us here, they are present with us in spirit, if that makes sense.”\nConsidering the future of MOAA, Li drew upon inspiration from Phillips Exeter Academy, which has hosted a similar math competition for several years. Li hopes to mirror this longevity with MOAA’s future development.\n“Exeter has one that's been going on for a long time, and I've been to that one a couple of times. And MOAA… is new. This is only our second year doing it. I really want this to be a tradition that we can do every year. Mainly because I'm an Upper this year and I'm on the board, I'm hoping to be able to help in a larger capacity next year,” said Li. \nEditor’s Note: Rachel Chang ’20 is a News Editor for The Phillipian. \n", "caption": "28 teams computed in this year’s Math Open tournament.", "credit": "T. WEI/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/news/math_open/Compressed_twei.mathopen.05.JPG", "headline": "Annual Math Open at Andover Draws 146 Local Middle Schoolers", "writer": "Melissa Damasceno & Erin Kim", "categories": "news", "more_options": ""}