{"article_content": "\n\nLaughter filled the Mural Room as students from all grades crowded around four separate tables, sharing \"boring\" facts about themselves. These truths ranged from their favorite food to their ethnic identities. As more people talked, the volume in the room continued to rise, and people began to get to know each other. \nNatalie Shen '20, Co-President of Asian Society, commented on her surprise at the popularity of the event.\n\"A lot of the Asian community [at Andover] may feel shy to branch out in the beginning, but I was really surprised by the sheer amount of new kids that wanted to interact with the rest of the Asian community [at Andover]. I was just really touched by that and it gave me a lot of hope for this coming year,\" said Shen. \nOn Friday, Andover's Asian Society held a dessert reception to welcome students and introduce several on-campus clubs that represent Andover's pan-Asian community. According to Frank Zhou '23, he did not expect the wide diversity of students present.\n\"I was blown away by the true depth and breadth of the Asian population on campus. I had no idea there were groups, [such as] Andover Muslim Society, [and] all of the different affinity groups from pan-Asian to the [Andover] Chinese Student Association,\" said Zhou. \nMany of the people attending the event were new students. Lily Haik '22, from Hong Kong, shared her experiences growing up surrounded by an Asian community. After arriving at Andover, she wanted to feel the same comfort with Asian students from all around the world.\nAccording to Shen, she feels comfortable in her Asian identity at Andover and mentioned how she hopes to spread that notion of acceptance to all Andover students.\n\"I heard a lot of people feeling like they couldn't come to Asian Society just because they felt uncomfortable. That means to me that we haven't sent out our message properly. I want it to be a space to be inclusive, where people feel comfortable to be here,\" said Shen. \nWilliam Yu, Teaching Fellow in Physics and faculty advisor to the Asian Society, commented on the importance of hosting such an event. He emphasized the variety of perspectives from the people attending the reception.\n\"I want people to form meaningful connections with each other--just become more proud [and] confident in their sense of their identities... From international students who had never been to the United States before, to people like me that have [had] several generations living in the States, you realize that despite all these differences, you still have so much in common and so many shared experiences,\" said Yu.\nThroughout the evening, people mingled and enjoyed desserts. According to Evan Tsai '21, his favorite moment was meeting the new students and helping them integrate into the community.\n\"I've been to Asian Society a few times before. I know most of the board members. I know the vibe around [there]. It's always very welcoming, very inclusive. I'm just glad that the new kids were able to meet everyone and make new friends,\" said Tsai.\nAccording to Shen, Asian Society will be at the club fair in late September, where new members can sign up for the club. In addition, they will be selling their annual Andover/Exeter shirts, as well as hosting weekly meetings on a variety of discussions related to the pan-Asian community.\n\n\n", "img_path": "nophoto", "headline": "Asian Society Dessert Reception Brings Andover's Asian Population Together", "writer": "jerry shu and natalie chen", "categories": "arts,featured", "more_options": "--post_date='2019-09-20 14:28:19'"}