{"article_content": "\n\nCiting examples of cultural appropriation in contemporary media and pop-culture, Adrienne Keene, Assistant Professor of American Studies at Brown University, walked her audience through misconceptions of Native American societies with a presentation in recognition of Indigenous Peoples’ Day. \nKeene’s presentation, “Native Representations, Pop Culture, and Cultural Resistance in Cyberspace,” was held in Kemper Auditorium on October 10 and marked the start of a series of presentations sponsored by Native Americans at Phillips Academy (NAPA), according to organizer Emma Slibeck ’20.  \n“Half of our group’s goal was to create a safe space for Native American students on campus, and the other half was to bring more awareness to indigenous people’s modern issues. Particularly, we wanted to celebrate the diverse histories of Native Americans and our presence and existence today. While doing some research on this, I got to listen to Dr. Keene’s podcast, which led me to invite her,” said Slibeck. \nKeene began the talk by discussing how several stereotypes of Native American culture embedded in American society are overly simplified and monolithic. Keene used the example of feathered headdresses depicted in American media, and explained how stereotypes such as these are are ignorant to the diverse and complex traditions of Indigenous people. \nKeene said in her presentation, “A lot of the images that people think of indigenous people are men in feathered headdresses…. The reality is that there are more than 500 distinct native tribes in the U.S., and that there are only a few tribes that wore these headdresses. In fact, such materials are even considered sacred to them, not a daily item.” \nAdditionally, Keene pointed to other American illustrations of native culture as examples of the normalization in American institutions and popular media of what she terms as blatant racial insensitivity. In particular, she emphasized the offensiveness of Native American imagery by sports teams.\n“It is important to note that there are a lot of costumes of Native Americans, some even sexualizing women—these costumes stem from the stories of Peter Pan. The song, ‘What makes the red man red,’ is so awful that I cannot believe that such racial insensitivity still exists… Even prestigious universities like Stanford had an Indian mascot until 1971. Though it was changed thanks to student activism, Indian mascots are still widely used by different sports teams. The N.F.L. football team from our nation’s capital, in fact, has such a horrible name that I cannot say it,” said Keene.\nKeene’s feelings surrounding the cultural prevalence of teams such as the Washington Redskins resonated with Naiya Roe ’21, an attendee of the event. \nRoe said, “A few days ago in [Paresky Commons], people sitting next to me were projecting the Washington football team’s games on the screen. While the name is incredibly racist, I don’t think that is something that crosses people’s heads when watching the football game. It is just kind of the things that we do in daily life that actively hurt indigenous people.” \nAccording to Keene, it is important to recognize the potential dangers brought by such \nmisrepresentations in media and culture. She explained how the general increase in media consumption by the general public can lead to a propagation of harmful representations of indigeneous people. \n“We are constantly conceiving information and images in today’s society, because we are glued to our phones and devices at all times. This means that the stream of images we receive is constant, and that those images really get embedded in our brains, but there is such an invisibility of native representation, and the ones that exist are very negative. Because of our easy accessibility to information, it is important to think about how natives are represented,” said Keene. \nKeene additionally noted that the lack of authentic native representation in America correlates with less attention paid to ongoing, modern issues within different native communities. Keene referenced the modern issues surrounding gender-based violence in indigenous circles. According to the National Resource Center on Domestic Violence, indigenous women “are 2.5 times more likely to experience sexual assault crimes compared to all other races, and one in three Native American women reports having been raped during her lifetime.”\nKeene continued, “They also erase our contemporary lives, painting us as a group that only existed in the past. When you erase our contemporary existence, not only does it erase our joys going on in our communities, it also erases the very struggles that we still have. If you might think we all died out in the 19th century, contemporary violence against women and our environmental issues all don’t exist.”\nIn an effort to combat this phenomenon of erasure, Keene recommended the audience to address others who have incorrect perceptions of Indigenous people and stressed the importance of supporting Indigenous students and communities on campus. \nKeene said, “The biggest thing is not being afraid to talk about the misrepresentation of native culture. When you see a classmate who is wearing something harmful or offensive, it is hard to address them due to the small amount of native students on this campus. I hope others have enough information to address those peers as well, in order to combat such misrepresentations on this campus.” \nAccording to Slibeck, NAPA plans on featuring more speakers in the future. Slibeck noted that many of the topics Keene discussed will be mentioned further in detail. \n“NAPA is working on bringing a couple more speakers in the spring. We are also looking at addressing the issue with the Washington [Redskins] football team, and bringing awareness by writing informational messages of Native Americans on Indigenous Peoples’ Day. We are also trying to get the flags of our forgotten nations, and hang them alongside the other international flags during events,” said Slibeck. \n", "caption": "Adrienne Keene writes about issues of representation that Indigenous Peoples face in her blog, “Native Appropriation.”", "credit": "Courtesy of Emma Slibeck", "img_path": "/home/plipdigital/wp-photos/10-18/news/keene_talk/eslibeck.keenetalk.jpg", "headline": "Adrienne Keene Discusses Misrepresentations of Indigenous People in America", "writer": "Aaron Chung", "categories": "news,featured", "more_options": "--post_date='2019-10-19 16:06:39'"}