{"article_content": "Bruce Anderson ’90, Professor and Associate Chair of the Department of Geography and Environment at Boston University, exhibited his recent work scrutinizing how climate change contributes to atmospheric and oceanic variations on October 10. Anderson’s presentation, “The Global Gamble,” was the second talk in the Climate Cafe Series, a year-long exploration into climate change hosted by the Oliver Wendell Holmes Library (OWHL).\nAnderson examined how the psychology of people discussing climate change is similar to that of gamblers. He described how the climate crisis is predicated on ambivalence derived from the “Gambler’s Conceit,” which is the fallacy where the gambler believes that they can terminate risky actions when they are ahead. Anderson connects the idea to the environment because he believes that people should disengage with behavior that is detrimental to the planet now, before the situation gets worse and ruins the planet for future generations. \n“Fossil fuels have been able to make profound advancements to society and improve the wellbeing of millions beyond measure with fairly little cost to the environment where we live. The question is: can we walk away while we’re still ahead? Or are we, instead, doomed to ‘Gambler’s Ruin,’ which is the outcome of Gambler’s Conceit…What are our options? How do we walk away? We have to recognize that now is the time to play a different game, one in which we do conserve people’s lives and livelihoods… without gambling away our children and grandchildren’s environments. It is time to walk away,” said Anderson. \nAccording to Anderson, the climatic conditions that effectuate the contemporary variable climate have caused an increase in the average temperature. The ramifications of the uptick in temperature reverberate in ecosystems across the globe and result in thousands of deaths. \nAnderson said, “In the 2100s, we are going to geographically migrate effectively 1,200 miles in the course of a snap. Effectively, Boston is going to move to Miami… France, in particular, in 2003, suffered a heatwave for two weeks with elevated temperatures in the 90s…70,000 additional deaths [occurred] in those two weeks from those elevated temperatures. [In] Russia, 2010, elevated temperatures again, in about the mid-90s, two weeks at the end of July, [caused] 50,000 deaths. The largest sort of mortality by far due to natural hazards is heat.”\nThe heat is not the only problem, however, as rising sea levels will contribute to hurricane-level flooding in cities, according to Anderson. \n“Our defenses against Hurricane Sandy held by 3 inches. Why? Because Hurricane Sandy hit at a particularly low tide. Had it come two hours earlier or two hours later… the Back Bay would have become a Bay… The expectation under a high emissions scenario ‘business as usual’ that sea-level rise for Boston in the next century will be about two meters or six feet. If you were to live sea-level by six feet and to ask how often winds or storm would inundate our current one hundred year defenses, how often would we get Sandy-level street flooding, [the answer would be] every month,” said Anderson.\nAttendee Dylan Herlihy ’22 thought that Anderson succeeded in using specific scientific figures to reveal how climate change will have transformative environmental and societal repercussions on the structure of the planet. \n“The most powerful diagram for me was showing the climate movement geographically in 80 years from now. Seeing how the climate of Miami, Florida could become the climate of Boston and the climate of Vermont could become the climate of Tennessee and the images of vegetation become starkly white as well as his continuous disproving of data that suggests climate change is not as bad as it actually is,” said Herlihy.\nDerek Curtis, the Programming and Digital Content Producer and Adjunct Instructor in Philosophy and Religious Studies helped to organize the Climate Cafe Series. He brought Anderson in because of Anderson’s status as an alum and expertise in the field of climate change. Curtis hopes this series will encourage Andover students to acknowledge the scientific data backing climate change, and will show how individual students can help ameliorate the crisis. \nCurtis said, “I think some of that comes down to larger-scale issues—the decisions the school makes about how we’re going to source our energy and what the school is going to do from a top-level to individual students. What do you choose to do? Are you doing any of the things he said to do to lower your carbon footprint? Shorter showers? Maybe eat meat less. All the typical things that are offered up for students to do… and in some way be models for other people... That’s crucial for this campus, and for this world in general.”\n", "img_path": "nophoto", "headline": "Bruce Anderson ’90 Explores How Climate Change Will Transform the World", "writer": "Amber Ting and Will Yue", "categories": "news", "more_options": ""}