{"article_content": "Written in chalk, phrases like “Columbus is a murderer,” and “Whose land are you on?” appeared across campus on the morning of Indigenous People’s Day. Students walking to class saw these messages in front of buildings like Paresky Commons, Morse Hall, and George Washington Hall. \nEmma Slibeck ’20 and Tomafa Ticeahkie ’21, Co-Heads of the affinity group Native Americans at Phillips Academy, organized these messages to raise awareness about the celebration of Columbus Day and the fact that Andover is built on the traditional land of the Wabanaki and Naumkeag peoples.\nSlibeck believes that the erasure of indigenous communities from history still permeate modern society. She explained that two of the phrases, “Whose land are you on?” and “Know their name: Naumkeag and Wabanaki,” aimed to show Andover’s complacency and silence on Indigenous issues.\n“We [wanted] to really draw attention to whose land [Andover] was built on. [Andover] was built on the unseated land of the Wabanaki and Naumkeag peoples, and I don’t think anybody could tell me that. I couldn’t even tell you that until a week ago or so. I think the ‘Whose land are you on?’ was the big thing that we had around, because people don’t really think about it,” said Slibeck.\nWhile Slibeck appreciates that the chalk has sparked conversation on campus, she was frustrated by some negative responses. One of the “Columbus is a murderer” messages outside GW was defaced; the word “murderer” had been anonymously wiped and washed away.\n“Someone had smudged out the word murderer and poured water on it, which is [definitely] frustrating... It doesn’t take away from what [Columbus] did or the legacy that he left behind, and it was really disheartening to see that on our campus, someone actively smudged it out. That was the most negative response I got,” said Slibeck. \nThe chalk reminded Ariel Wang ’21 of Dr. Adrienne Keene’s talk, “Native Representations, Pop Culture, & Cultural Resistance in Cyberspace,” which happened on October 10. Wang expressed disappointment that she hadn’t known about the Wabanaki and Naumkeag land before, despite having been an Andover student for three years. \n“That was the first time I heard someone do a land acknowledgement. [Ticeahkie] and [Slibeck talked about it] before the presentation, and I feel like I should have known about that a long time ago. I should have known whose land I was on a long time before three years after being here, so that was a reminder in a way,” said Wang. \nIn her talk, Keene noted that students play a role in bringing awareness to historical omission. She also emphasized the responsibility that people have in being aware of the history of land in America, as well as the contemporary contributions and representations of Indigenous people.\n“Students are in classes, learning American history, environmental science, and all different areas of studies. These are areas where indigenous people made contributions, continue to make contributions, where our knowledge is important and matters in those spaces. Students should ask their teachers for more representation of more contemporary native people. Everywhere you walk in is indigenous land. They should think more about these topics and be aware of those topics,” said Keene. \n", "caption": "", "credit": "A.. LEBARON/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/news/chalk/Compressed_alebaron.chalk copy.jpg", "headline": "“Whose Land Are You On?”: Chalk Writings Bring Awareness to Indigenous People’s Day", "writer": "Will Yue", "categories": "news,featured", "more_options": "--post_date='2019-10-19 16:06:45'"}