{"article_content": "According to Sam Elliott ’22, Andover Boys JV1 Soccer team currently holds a 4-2 record because of a number of standout players.\n“Our team has generally performed well, and has been greatly helped by a few star players. [Josh Park ’22] as Striker is the leading goal scorer for our team, and his foot skills and shooting prowess has definitely led to many of our goals. [Leo von Bernuth ’22], at the center mid position, is a new Lower from Sao Paulo, Brazil, who has been an integral part of our team,” said Elliott. \nThe boys soccer program has Varsity, JV1, JV2, and JV3 teams, making it the only program on campus that extends to a third Junior Varsity team. According to Elliott and Kris Aziabor ’22, [Co-Captains] Nic Lam ’22, Max Guan ’22, and Josh Park ’22 comprise a crucial portion of the skillset JV1 has to offer. \n“They are the only returning players on JV1, and they definitely up the skill level on our team. Each display their leadership in different ways,” said Elliott. \nAziabor said, “They have been great leaders on and off the pitch. From leading the warmups to giving the team advice on how to enhance our game, they work hard to make sure everyone is at their best. On the field, they are consistent starters. I think the most important thing they have done as captains has been lifting the team. They ensure that everyone that is on the field and also on the bench is tenacious thanks to their passion of winning.”\nSo far, the team has been proficient at moving the ball up the field to create space and opportunities to score, according to Kris Aziabor ’22.\n“I believe that on the field we have excelled at passing out from the defensive line and creating many chances. We have never failed to score in a match, and in most matches we score 4-5 goals,” said Aziabor. \nDuring practice, the team focuses on game-like drills, developing foot skills and using the home field to its advantage, according to Marcus Sapuppo ’23.\n“We’ve been working a lot on passing the ball quickly and hanging on to the ball for less time. In practice, we do a lot of possession [drills] because...those who can play quickly and control the game are the ones who will win the game. Also, our home field is very uneven so we do a lot of basic skills drills such as shooting and passing because it’s always good to develop in those areas, but also to make sure we have the upper hand when it comes to playing on unpredictable fields, or our slanted, bumpy, home field,” said Sapuppo. \nThe team will look to increase its level of play during the rest of the season, according to Aziabor. \n“The intensity has certainly increased over the past days but there’s more to come. I fully believe in this team and think that despite our great start, our best performance is yet to come,” said Aziabor. \n", "img_path": "nophoto", "headline": "A Focus on Building Skills Strengthens Team Culture on JV1 Boys Soccer", "writer": "Sarah Karlen", "categories": "sports,boys-soccer,fall-sports", "more_options": ""}