{"article_content": "Besting his time trial result from the previous week, Sam Capobianco '21 placed 21st in the Varsity race with a time of 18:06 to help Andover Boys Cross Country win fourth place in the Bobcat Invitational on Sunday. \n\"I think [Capobianco] might have been the only one on the entire team who ran faster than the time trial, which is saying something. He had a really good race, and he tackled those hills with confidence, and it clearly showed. He came to compete and he passed a lot of people. He came 21st-almost there to getting a medal,\" said Captain Alex Fleury '20, who placed fourth overall in the varsity race with a time of 17:04.\nThe Bobcat Invitational served as the team's opening meet, and it was the first time anyone on the team had ever competed on the course, according to Fleury. \n\"The meet had a wonderful energy. The meet director said that many consider the Bobcat course 'the toughest in New Hampshire,' so it was an excellent early-season challenge for our team,\" Head Coach Patrick Rielly wrote in an email to The Phillipian. \nThe course and race environment had a similar setup to Interschols at the end of the season, allowing the team to get a feel for that type of environment, according to Rielly.\nReilly said, \"In order to prepare for Interschols, which is a multi-team invitational meet, we wanted to get some experience racing against a large field of runners. Bobcat has been a great meet for many years, and since it always features great competition, we were thrilled to join the event.\"\nAccording to Harrison Wilson '20 and Anthony Minickiello '20, the course was a challenge that mimicked the hills at Northfield Mount Hermon, where the team will compete in two weeks and at Interschols.\n\"It's necessary to really dig in and put in a constant effort. It's not necessarily about who has the fastest legs or the speediest times. One really has to be able to maintain their speed and use their endurance to just go up and down the rolling hills of a course like this,\" said Wilson.\nThe team has a lot of depth in its Varsity and JV squads, according to Wilson. \n\"Our depth is especially beneficial this year because we have a range of underclassmen. We have a good group of about four to five Seniors that's pretty strong, and beyond that we have a couple of Uppers, a [Junior], and new people who continue to ensure the strength of our program,\" said Wilson.\nHe continued, \"Will Hetherington '20 comes to mind. He ran in the JV race up at the front for a majority of the race. He really put in a good effort this weekend. He ran the JV race, but I know he's capable of moving up to the Varsity squad and I think this race was a really good demonstrator of his progress and of the people beyond the top seven who can fill in and help the team.\"\nThe team will focus its training on preparing for the NMH Invitational on September 28, which will set a standard for Interschols.\n\"I'm not sure what Coach Rielly has in mind, but we'll definitely train for the next few weeks ... hills, definitely some tempo sort of stuff, and try to stay on the grass as much as possible, not only to emulate the course at NMH, but just to keep the pressure of running on hard surface off our feet,\" said Fleury. \nThe team will compete in the NMH Invitational on the 28.\n\n\n", "img_path": "nophoto", "headline": "Boys Cross Country Secures 4th Place Varsity Team Finish at Invitational", "writer": "Abby Ryan", "categories": "sports,boys-cross-country,fall-sports", "more_options": ""}