{"article_content": "Ariel Wang '21 was only two years old when she started playing the piano at her kindergarten. She started participating in competitions at age seven, and at age nine, she joined the school band as a flutist. Since then, Wang has collected many prestigious awards and accolades for both piano and flute, including being one of the youngest people to have been named Canada's \"30 Under 30\" top classical musicians for Canadian Broadcasting Corporation (CBC) this summer. \nDerek Jacoby, Instructor in Music and Wang's flute instructor, said, \"It was extremely impressive because when you read through the article, I believe they did it by age, so you're kind of scrolling down and she's near the bottom because she's so young. If you think of people all the way up to age thirty, most of them were well into their twenties and she's on that list.\" \nWhen she's at Andover, Wang practices her instruments for anywhere from one to six or seven hours. Wang will be performing a piano solo in Carnegie Hall in November after winning the American Fine Arts Association competition this past June. \nFellow musician and friend Luke Henderson '21 is impressed by Wang's motivation and high level of skill in both the flute and piano.\n\"The fact that she plays two instruments, the piano and the flute at such a high level is amazing. It's really cool to know that people I have worked with and people I go to school with are part of such big things,\" said Henderson.\nMany of Wang's peers and teachers recognize her talent and versatility as a musician. According to Jacoby, he feels confident when giving a difficult piece to Wang, knowing she would work hard and be able to play it. \nClassmate Evan Tsai '21, a bassist and cellist, said, \"I think the amount of effort she puts into her playing and the virtuosity she displays during not just performances, but also rehearsal really sets her apart from other pianists.\"\nWang cites Michelle Obama as a major source of inspiration in both her life and her music, mentioning a passage in Obama's memoir about how music gave her a peaceful home-like environment. She also credits classical pianist Evgeny Kissin and pop artist Beyonce as sources of inspiration for her music. According to Wang, one morning before a competition, she was watching Beyonce's documentary \"Homecoming\" for motivation.\n\"I think that it was a source of confidence, as the piece [I was going to play] was really big and grandiose. [The classical pianist] Kissin, as well as Beyonce...helped me. I don't think I'm a very big person. My hands are small [and they] kind of broke playing the piece, but it was the energy of [Beyonce and Kissin's] performances that carried me through,\" said Wang. \nAccording to Wang, she wants music to remain a major part of her life during college and in adulthood, despite her numerous other interests.\n\"I have a lot of interests that don't relate to music at all ... [but] the lessons that it has taught me has carried me through everything else. I hope when I go to college and when I'm an adult and have a job that I can practice and share it the way I do now. I don't know if that will be possible, but that would be my dream,\" said Wang.\n", "caption": "Ariel Wang '21 also won the American Fine Arts Association competiton in June and will be performing in Carnegie Hall in November.", "credit": "S. ZHANG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-14/arts/ariel/Compressed_Compressed_szhang.ariel.01.jpg", "headline": "Ariel Wang '21 Makes Canada's \"30 Under 30\" Top Classical Musicians", "writer": "Natalie Chen", "categories": "arts,featured", "more_options": "--post_date='2019-09-15 14:14:45'"}