{"article_content": "When he’s not competing for Andover Boys Cross Country, Glen Cahilly ’23 is working on creating 3-D printed maps of racecourses for the team, including those of Choate, Andover, and Northfield Mount Hermon. \nCahilly’s models help the team with its pace as well as allow runners to better visualize the course, according to Head Coach Patrick Rielly and fellow runner, Samuel Capobianco ’21. With a 3-D model, runners can see where inclines and downhill portions of the courses are. \n“Glen's project is a very creative way to help us think through courses visually. Two-dimensional course maps only give us part of the story, but in three dimensions, we can see elevation changes and get a sense of what the rhythm of running might be,” said Rielly.\nCapobianco added, “We really want a good layout of the course to figure out how we want to run our race and how we want to pace each other so it would be really helpful if we could have a clear layout of the course was like beforehand. On uphills, we need to pace each other and go slower so we can conserve energy. Especially in the later half of the race, it is important that we prepare for those big hills.” \nInspired to print different course models by his father, Cahilly got to work figuring out how to put his plan into action. According to Cahilly, he conducted outside research and consulted The Nest for help beginning his project.\n“I did a lot of research trying to figure out the best way to do this and I realized that if you take a run on Strava, [a software used to track running exercises through GPS data], you can upload the GPS data to your computer. From there, I used an online source that converts the data into a 3-D model for you and then I put it into the maker bot software which 3-D prints it,” Cahilly said.  \nAccording to fellow runners and teammates Douglas Yang ’20 and Capobianco, the course models will allow the team to better prepare for its away meets by allowing it to focus its workouts during the week off the course it will be competing at the coming weekend.\nYang said, “I think the models come in handy if we can analyze them as a team before practice, so at times we can tailor our workouts to some of the hard parts of the course. It essentially gives us more insight into the course and we can tailor our daily practices to them.”\nCapobianco added, “Say we have an away meet and we have a 3-D model of the layout: we can mimic the course in a workout. If there is a long hill, we might do some tempo pieces to start out workout and then do some long hill pieces at the end to replicate what the course would be like.”\nFollowing a victory against Choate last Saturday where Andover swept the top five places and earned a perfect score, Cahilly hopes the course models will continue to provide team with helpful insight that will lead to more success this season. \n“I think it is definitely helpful for my teammates and my own understanding of the courses. Of course, you don’t want to do worse in a race just because you don’t know it well. If you can get a good understanding of the course, and other teams can’t, it’s like a home course advantage, because you can visualize it more easily,” said Cahilly.\n\n\n", "caption": "", "credit": "PHOTOS COURTESY OF GLEN CAHILLY", "img_path": "/home/plipdigital/wp-photos/10-18/sports/coursemap/Compressed_IMG_0192.jpg", "headline": "Glen Cahilly ’23 Uses 3-D Modelling To Create Course Maps", "writer": "Nicole Lee", "categories": "sports,,featured", "more_options": "--post_date='2019-10-19 16:06:48'"}