{"article_content": "Alarms blare as Alycia Basquiat ’20 and Layomi Oloritun ’20 scamper towards the center of the stage, jumping into an imaginary time machine. Suddenly, the lights begin to whir wildly in bright bursts, until a sudden darkness blankets the stage completely. A few seconds later, the rest of the Hypnotiq members lumber into view, impersonating robots from the future. Scrambling to fit in with the futuristic identities, Basquiat and Oloritun attempt to save the inevitable future of hip-hop.\n“Our concept is basically how me and Layomi, the other Co-Head of Hypnotiq, get into a time machine… to save the future of hip-hop… We crash, and then all the robots come in so we start dancing with them, but then at the end, there’s a big explosion, [which is] what we wanted to stop. We wanted to stop hip-hop from blowing up, basically,” Basquiat said.\nAccording to multiple performers, Grasshopper’s acts varied in their interpretations of the theme of “The Future,” with topics ranging from climate change to the evolution of dance. Zar Cordova-Potter ’20, theater director and producer of Grasshopper, expected most people to take the theme literally, but much to her surprise, this was not the case. \n“We were worried that people would take ‘The Future’ and put robot costumes on... The amount of creativity that people went through is honestly astounding—we thought that there would be one or two people that went somewhere creative with it. Instead, everyone just completely revolutionized everything—I was so impressed,” said Cordova-Potter.\nWith a combination of shimmering bells and coordinated harmonies, Handbell Choir begins the annual show with their take on ‘A Whole New World.’ Starting off relatively soft with linear melodies, the bells grow in intensity and eventually merge together, chiming a final chord in unison before the lights go out. Alana Yang ’21, member of Handbell Choir, believes that the song directly relates to how people view the future: a whole new world.\nYang said, “At the beginning of the year, we had a list of pieces that we were planning to perform and ‘A Whole New World’ was a part of it. So it just happened to fit into this theme of the future, and that the future is a whole new world, something that’s different from the world that we live in now, so we thought that was something we could perform for Grasshopper.”\nFootsteps, JVNE, and Blue Strut used their performances to present their belief of what the future would look like: a more equitable world filled with female empowerment. To display that concept, the dance groups chose songs and choreography that would emphasize this message.\nNatalie Shen ’20, a member of JVNE, said, “Traditionally a lot of K-Pop dances, for females, are usually very feminine and really fragile. So we decided that we were going to be women, but do a traditional guy dance, so we decided to bring a lot of power into our song, and it’s futuristic in the sense that [first], there’s Asian women on stage and [second], the song is questioning the future and how women can be bosses. So we fell in love with that concept and ran with it.”\nOther groups decided to take a look back into their own art form’s past in order to reconcile the present and shape the future. Fusion began their act with the roots of Afro-Carribean dance, but changed their choreography mirroring the changes that happened to their style of dance throughout time.\nClaude Sayi-Amen ’21, Co-Head of Fusion, said, “We didn’t know really know how to fit [the theme of future] into Afro-Carribean culture, but then we said, ‘Why don’t we focus on the African diaspora and the history of our culture?’ So that’s why we start off with the quote, ‘Culture doesn’t make people, people make culture.’ We go through the different times of Afro-Carribean, then Hispanic, and new Afrobeat tech dances throughout a timeline.”\nThe show ends with a performance from the band The Turn-Offs, playing “I Melt With You” by Modern English. Band members form a semicircle on stage, donning retro visor shades. Accompanied by electric guitar and roaring drums, the song provides a triumphant ending to the hour-long performance.\nCordova-Potter offered another interpretation of “The Future,” choosing to focus on Grasshopper itself and its legacy. She believes that Grasshopper should reinvent itself rather than rest on its traditions, year after year.\n“When we originally thought about 'The Future,' in a big way we wanted to tear down the history of legacies that Grasshopper has. There are a lot of groups who feel that they're guaranteed to get into Grasshopper, because they've gotten into Grasshopper in previous years or the groups themselves are really old—they feel like they're well-established on campus. We wanted to [say,] ‘No! This isn't about the past. This is about the future.’ This is about upcoming groups, about new ways of revamping the old groups, about who are you going to be,” said Cordova-Potter.\nGrasshopper will have four performances this weekend: Friday at 6:00 and 9:30 p.m. and Saturday at 8:00 and 9:30 p.m.\n", "caption": "", "credit": "D.AVID Z/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/ghopp/Compressed_dzhu.ghopp.02.jpg", "headline": "Grasshopper 2019 Embraces ‘The Future’ Theme In Annual Family Weekend Performance", "writer": "Staff Report", "categories": "arts,featured", "more_options": "--post_date='2019-10-20 00:50:27'"}