{"article_content": "\n\nAfter five years as the director of the Addison Gallery of American Art, Judith Dolkart will be leaving her position this December to become deputy director at the Detroit Institute of Arts in January. As director at the Addison, Dolkart was responsible for all the operations and curation duties. In her new position, she will be working as a curator as well as creating educational resources.\n“I’ll be responsible for the curatorial side of house, as well as education and programming, so working with the curators on their collections, exhibition ideas and ideas for acquisitions…Then for education, they have a very robust educational department that serves children and adults from three counties all around Detroit. Programming will be things that complement whatever the exhibitions are… This could be a wide variety of activities for children and adults,” said Dolkart. \nOne of the reasons that Dolkart has decided to take the new job is the vast amount of resources that will be at her disposal working for an institution such as the Detroit Institute of Arts. From the diverse art collection to the wide range of departments, Dolkart believes she will have more opportunities to explore work in her field.\n“Detroit has one of the best collections in the United States. It’s an absolute killer, and it’s encyclopedic, so it has many different kinds of departments. It has European paintings, American paintings, African art, Asian, Islamic art, so lots of different aspects… It’ll be fun to look at other cultures, and other styles and ideas and artists,” said Dolkart.\nDolkart expects her experience in curatorial direction at the Addison to be valuable in her new role. One of her hopes for her new job is to share the wonder in the discovery of art, which she experienced in her cultivation of the Addison collections. \n“I love the moment of discovery when students come into the museum learning center and they see something for the first time, or they make a discovery for themselves about something that they’re looking at. It’s something they see in the object themselves, and you can’t beat that,” said Dolkart.\nWorking in museums has been Dolkart’s long-time passion. Even though some may consider curating a less accessible or normalized occupation, Dolkart’s family history and educational path led her down the road of museum work.\n“I had a grandmother who worked at a museum when I was growing up, so I got to see the behind the scenes, which made the museum more magical to me. And, I went to [Phillips Exeter Academy]. When I was there, I went on a school year abroad and I went to France, and we were required to take art history, which was not in any way a burden. We would study things in the classroom and then we would go to see them around France…and to me that became so exciting. You’d study this thing, and then you went and saw it… and that’s when I decided that that’s what I wanted to study in college, art history. And then I became a specialist in French Art,” said Dolkart.\nAside from Andover and its students, Dolkart will miss her colleagues at the Addison. \n“They are not only the best at what they do, and that’s a professional distinction, but they’re also great people. They’re smart, and they’re funny and they’re a pleasure to be with every day…they’re creative, they’re thoughtful, committed professionals,” she said. \n", "caption": "Judith Dolkart began her tenure at the Addison Gallery of American Art in July of 2014.", "credit": "COURTESY OF SUSAN BEARD", "img_path": "/home/plipdigital/wp-photos/10-18/arts/judith/judith.courtesyofsusanbeard.JPG", "headline": "Director of the Addison Gallery Judith Dolkart Accepts Position at the Detroit Institute of Arts", "writer": "Aleisha Roberts", "categories": "arts", "more_options": ""}