{"article_content": "Nicola Sommers PG'20 netted a penalty kick against Rivers last Saturday to lead Andover Girls Soccer to a 4-0 victory over Rivers at home. \nAfter losing to Rivers last year, defeating the team helped unite the players according to Emma Fogg '21 and Lily Haik '22.\n\"We lost to [Rivers] last year 2-1, so winning 4-0 helped show our growth as a team and how we didn't psych ourselves out because of our previous loss last year,\" said Fogg.\nHaik said, \"Everyone was so happy after we won, there were even tears from some of the other girls and I think that this game helped us come together as a team.\"\nAccording to Fogg, the defense and goal-keeper Emily Hardy '20 were crucial aspects in Andover's victory over Rivers.\n\"Most of the goals scored so far have been by counter-attacks. I remember during the game Emily Hardy went in with the ball on a counter-attack and scor[ed]. Defensively I think we played really well too. We were really solid. We shut down all the strikers Rivers had coming at us basically the entire time. The rest of the field was really on fire [too],\" said Fogg. \nLater in the week Andover secured a 1-1 tie against Pingree on Monday and a 3-1 win at Middlesex on Wednesday. The team's record now stands at 3-0-1.\nThe team adjusted its play for the different styles from Pingree and Middlesex, according to Mack Lucas '20. \nLucas said, \"Pingree played a different style than Rivers played. Rivers had a more direct approach with the ball while Pingree played more possession, and it took us a while to recognize that.\"\nDespite the challenge against Pingree, certain players were able to rise and help the team, such as Karoline Conte '21, who was named Player of the Game, according to Lucas.\n\"[Conte] was running at people, she helped us keep our tempo up. Same for Anna Hurley ['21] who played midfield, she would help run our tempo and keep us going during the game even when we were all exhausted. Also Emily Hardy, back at the net, when we were tied, she helped us keep focused after halftime,\" according to Lucas.\nAccording to Myra Bhathena '22, Middlesex's defense made it difficult to get in scoring position.\nBhathena said, \"Middlesex played a very defensive game where they played numbers in their defense, so it was difficult to get the ball in. A lot of us were anxious leading up to this game because we haven't been able to practice as much recently due to all the games, and we only had four [substitutes] which was unusual.\"\nThe team maintained its tenacity throughout the entire Middlesex game, according to Bhathena. Kendall Toth '23 started both halves and scored the team's only goal of the game, earning her Player of the Game.\nAndover hopes to improve its ability to change its style of play depending on each opponent, according to Bhathena.\n\"We could work on adaptability. When we play different teams kind of figuring out how to change our play. We are a really talented team and we have a lot of talented individuals, who play really well together. But when we play together we should work on different styles and having different approaches,\" said Bhathena.\nThe team will travel to Loomis Chaffee this Saturday. \n\n\n", "caption": "Andover defeated Rivers this year following a loss to the team last year, inspiring morale amongst the team members.", "credit": "D.ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/gvs/Compressed_dzhu.gvs.0001.jpg", "headline": "Andover Adds Two Wins\n to Record", "writer": "Christine Michael", "categories": "sports,", "more_options": ""}