{"article_content": "Although the team hardly prepared for the competition, according to Jason Huang ’21, the Andover Physics Team won first place at the Yale Physics Olympics last weekend. Huang, who is a member of the team along with Julia Zhu ’20, Harry Shin ’20, and their captain, Misha Bilokur ’20, said that Andover was not expecting to place so highly. \n“We were very surprised, because we honestly did not prepare a lot for the competition, because the problems of the competition are mostly kept secret except for the quiz. We practiced for the quiz but we were not absolutely confident about the quiz either. So we were very, very, very surprised that we won Top 3 in several of the events and we won first for the whole Olympics,” said Huang. \nThe Yale Physics Olympics consisted of five different events. One involved optics and lenses, one measured how accurate and far a team could project a marble, and another scored a team on how accurately they could separate 30 grams of clay from a bigger piece. \nAccording to Huang, the only event that was revealed before the tournament, the quiz, contained questions like how many grains of rice are produced every year on earth. Andover placed in second for the quiz, according to Mika Latva-Kokko, the faculty advisor for the Andover Physics Team. \n“The [quiz] I found the most impressive of all of these, because...every school knows that there is going to be one task on the thermic quiz, and they prepare for it, and our preparation for it was on the car ride over to New Haven on Friday night,” said Latva-Kokko. \nAccording to Latva-Kokko, although the team did not prepare for the tournament in advance, their mastery of basic physics principles and troubleshooting an experiment is what caused their victory. \n“They had the right idea of how to approach each of the problems. It comes down to two things: one is that they are solid with their basic physics. They know which principles are going to apply. With that Young Physicists Tournament experimentation that they have been doing, they know how to troubleshoot an experiment. If an experiment is not working the way that they would like it to work. They know what to try to get it to work better. That's something you don't normally teach in class but they have gotten a lot of practice,” said Latva-Kokko. \nThe Andover Physics Team was originally formed last year to compete in another competition, the U.S. Invitational Young Physicists Tournament. Because only four students attended the tournament last year, the team is currently expanding into the Young Physicists Club to attract more students to join. \n“We have started a club called the Young Physicists Club and we successfully applied for an Abbot Fund last term. What we decided was to expand the team into a club for more people to get involved. For example, for the Yale Physics Olympics, a school can send multiple teams to attend. I think next year at this time we will probably send more people to Yale and to have more fun, the more the merrier,” said Huang. \nIn Andover’s first Young Physicists Tournament last year, Andover placed second place, losing to Exeter. This year, the team hopes to beat its rival and prove themselves, according to Zhu. \n“We are really hoping to make this competition a bigger deal, because this year, the competition is at Exeter, and we want to beat Exeter at their home ground. I think this specific event would allow us to first off, justify ourselves to the Physics Department and the Abbot Board for using their money and perhaps encourage them to give us more money in the future for that other competition,” said Zhu. \nAccording to Zhu, because the team currently consists of three Seniors and one Upper, they are trying to garner more club interest in an attempt to attract younger students to continue the legacy after three members graduate this year. Zhu explained how more members could lead to a bigger advantage over other teams in competitions. \n“In the other competition, it works more as a physics fight type thing. One side presents their research and their solution to the problem and the other team tries to poke holes in it, and it's sort of public speaking or debate type format. Other teams are allowed to send scouts out to take a look at your solutions so their team can prep in advance. That was a huge advantage that we didn't have but, [Phillips] Exeter [Academy], for example, did. We're hoping that with a club we can bring along scouts and have people to help us with our experimentation of things,” said Zhu. \n        Editor’s Note: Harry Shin is a Digital Editor for The Phillipian. \n", "caption": "From left to right: Jason Huang ’21, Mika Latva-Kokko, Instructor in Physics, Julia Zhu ’20, Misha Bilokur ’20, and Harry Shin ’20. This is the first year that the Young Physicists club has attended the Yale Physics Olympics.", "credit": "COURTESY OF JASON HUANG", "img_path": "/home/plipdigital/wp-photos/10-18/news/ypt/Compressed_courtesyjhuang.ypt.jpg", "headline": "Andover Physics Team Earns First Place At Yale Physics Olympics", "writer": "Laura Ospina", "categories": "news", "more_options": ""}