{"article_content": "As the ball rolled across the crease of the field, Jacque Harrington '20 scored a clean shot, earning one of Andover's goals in its 6-0 shutout of Thayer. \nAccording to Molly MacQueen '21 and Presley Kmeta-Suarez '22, the team's strong communication skills in it's game against Thayer led to more opportunities to shoot on net.\n\"I think we did a pretty good job finishing, which we struggled with in some of the past games where we got a lot of shots but couldn't put it in the net. So, I think it's really great that people were able to step up and finish it,\" said MacQueen.\nKmeta-Suarez added, \"I think on Saturday our communication was really good. We were communicating on and off the ball and we were doing a good job creating space.\"\nAndover Field Hockey secured a 6-0 win against Thayer on Saturday and continued the streak with a 4-0 win against Lawrence Academy the following Wednesday. The team's record now stands at 2-0.\nAgainst Lawrence on Wednesday, the score was knotted up 0-0 at halftime. In the second half, however, Andover scored four goals, securing the win and moving its record to 3-1-1 on the season. \nOne of Andover's four second-half goals was scored by Captain Carly Kreytak '20 off of a penalty stroke.\nOlivia Nolan '20 said, \"We were awarded a corner, and Linda Bibeau ['20] got the ball at the top of the circle and fired a shot on net, where it hit the foot of a Lawrence defender just as it was about to go in. We were then given a penalty stroke, which Carly put in the back of the net off a beauty of a shot.\"\nWhile Andover had a successful game against Lawrence, the team is looking to improve on maintaining high levels of intensity throughout the entirety of its future games, according to Kreytak.\nKreytak said, \"We can't underestimate any team and we need to be ready to [play with] full effort and intensity at all times. As long as we control the controllable and focus on the little things, the big things will take care of themselves.\"\nAlthough it is the beginning of the season, the team is already starting to improve on its technique and teamwork, according to Nolan.\n\"Our team is really starting to gel. In practice, everyone is extremely positive and comes ready to work hard. We are all very supportive of one another, and I think our chemistry will only improve as the season goes on. It's also been really fun seeing the new members of the team find their niches on [Andover] Field Hockey,\" stated Nolan.\nAndover will face Loomis Chaffee at Merrimack College this Saturday and hopes to continue their winning streak.\nEditor's Note: Linda Bibeau is a Sports Editor for The Phillipian.\nEOFXLII\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOlivia Nolan '20\nOn Saturday, I thought we did a good job of sending balls past Thayer's defense, which set our forwards up for some great shots on their goalie. Today, we came out a little flat in the first half, but we came out flying in the second half and got a lot of shots on Lawrence's goalie, allowing us to score 4 second half goals.\n \nThayer relied a lot on big hits to get the ball out of their defensive end, and as the game went on, we learned to adjust to that style of play and block up hits effectively. Towards the end of the game, we got some great interceptions that led to offensive possessions. I think we learned the value of playing as a team from our game today, because in the first half we were not communicating very well, and this made it difficult to connect passes.\n \nOur team is really starting to gel. In practice, everyone is extremely positive and comes ready to work hard. We are all very supportive of one another, and I think our chemistry will only improve as the season goes on. It's also been really fun seeing the new members of the team find their niches on PA field hockey.\n \nThere was a really awesome senior connection in our game today. We were awarded a corner, and Linda Bibeau got the ball at the top of the circle and fired a shot on net, where it hit the foot of a Lawrence defender just as it was about to go in. We were then given a penalty stroke, which Carly Kreytak '20 put in the back of the net off a beauty of a shot. Our senior class has a strong bond, so it was great to see it play out on the field like that. Another thing to note is that in the second half we scored 3 goals in 8 minutes.\n \nCarly Kreytak '20\nOne thing we did well on Saturday was moving the ball around the other team- when we communicate and work together.\n \nSaturday game- we need to learn that when we work together good things happen. From today- we can't under estimate any team and we need to be ready to play/full effort intensity at all times. As long as we control the controllable and focus on the little things, the big things will take care of themselves!!\n \nIt's going great! We are all getting to know each other as players and I know we have a long way to go until we are an actual team but so far so good.\n \nI scored on a stroke, which is basically a penalty shot. Linda Bibeau hit the foot of a defender which earned us a stroke and I scored.\n \nI think we showed our grit and really turned up the intensity in our game today. It was 0-0 at the half/ they were out playing us. We ultimately were able to step it up and score a bunch of goals.\n \n \nPresley Kmeta-Suarez '22\n \nI think on Saturday our communication was really good. We were communicating on and off the ball and we were doing a good job creating space. Today in the second half our energy was really good, and we were being aggressive. For example, stepping to balls for interceptions, doing a good job guarding inside the circle, etc. Our ball movement was also really good such as making good passes to space.\n \nSomething to take away from Saturday's game would be that when we communicate and work together as a team, we are able to capitalize and make good plays. Something to take away from today's game is when we are strong on the ball we are able to get rushes down the field.\n \nOur team dynamic at this point is great. I think that on the field we all trust each other with the ball and communicate well. Of the field we are all great friends and always have a blast.\n \nIn today's game we got a stroke. The equivalent of a penalty shot in ice hockey. Our captain, Carly took the stroke and lifted the ball into the left corner of the net. Everyone on the sidelines and on the field was screaming with excitement! It really lifted the team's energy and helped us get back in the game after an average first half.\n \nMolly Macqueen '21\nI think we did really well on Saturday. I think we still have a lot of things to work on, but I think the energy was really good. We obviously put a lot of balls in the net. We did a better job communicating than we had in the past. I think it exposed a lot of things, a lot of really positive things for the team going into the season, and a lot of areas that we need to improve.\n \nI think we did a pretty good job finishing, which we struggled with in some of the past games where we got a lot of shots but couldn't put it in the net. So, I think it's really great that people were able to step up and finish it. For example, Jacque Harrington '20 had a really nice goal right up close to the net. Things to get better at? I think our communication and getting our heads up and seeing what side of the field is open. Also using effective communication could always get better.\n \nI think the team is coming along really well. There's obviously a ton of new people on the team, but I think that Carly, as a captain, is a really incredible leader. The other seniors also do a really good job as well as the rest of the returners. They have all been super welcoming and supportive to all of us that are starting out. I also think a lot of some of the incoming students have brought a lot to the table. The team will continue to mesh a lot, but I think we're at a really good place.\n \nI think Jacque's goal was really nice. It was right in front and it was the kind of goal that we hadn't been finishing previously. The ball came across the circle, and she just swung it right in.", "caption": "Captain Carly Kreytak ’20 scored twice in the game against Thayer and once off a penalty against Lawrence.", "credit": "D.ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/pafh/dzhu.PAFH.12.jpg", "headline": "PAFH Shuts Out Both Thayer and Lawrence Academy", "writer": "Tiffany Li", "categories": "sports,,featured", "more_options": "--post_date='2019-09-20 14:28:11'"}