{"article_content": "Heading into the 2018-2019 NBA season, the Celtics were vaunted as Eastern Conference favorites and potential title contenders. Kyrie Irving had emerged as the team’s leader both on and off the court, and budding stars Jayson Tatum and Jaylen Brown were expected to take the next step in their growth and development. Gordon Hayward was set to return from a gruesome ankle injury to augment an already-strong roster. Many fans assumed a “finals or bust” mentality, as the hype around the young and electric team began to build.\nBut those sentiments, the hype, and the excitement all dissipated over the course of a season characterized by frustrating young talent, temperamental stars, and chronic underachievement. Hayward, a former All-Star who averaged over 21 points per game (P.P.G.) just two years prior in 2016-2017, failed to return to form and recorded a disappointing 11.5 P.P.G. Tatum, considered to be a bright young star on his way to perennial All-Star seasons, morphed into a more ball-dominant, less efficient version of himself. Brown, another cog in the Celtics’ lineup considered to have All-Star potential, had difficulty adjusting to a diminished role following Hayward’s return. \nKyrie Irving was stellar on the court, but a nightmare off it. He incited tension in the locker room, calling out teammates for poor play and frequently engaging in distracting exchanges with the media. Furthermore, his then-impending free agency called Boston’s future and foundation into question as signing rumors almost consumed the Boston sports news cycle. The Celtics ultimately limped to the finish line with a 4-1 series loss to the Milwaukee Bucks in the second round of the Playoffs.\nAll-Stars Irving and Al Horford, as well as integral players such as Terry Rozier[a][b] III and Aron Baynes, walked away in the offseason, marking the end of a tenuous year in Boston. The Celtics managed to recoup some of their losses by signing All-Star Kemba Walker and drafting promising guard Carsen Edwards. However, the question still remains: What’s next for the Boston Celtics?\nExpectations around the league have certainly died down in recent months. Though Walker is an exceptional player, few consider him as one of the league’s premier superstars. Furthermore, Tatum and Brown remain hard to quantify—will they move on from underwhelming seasons to adjust to larger roles and complementary play, developing into stronger contributors? Still, more questions about the Celtics’ projections emerge: Will the team be able to balance ball-dominant Walker and the rest of the Celtics’ offense? How will Hayward look two years post-injury? \nUltimately, there are more questions than answers here. The Celtics, regardless of their talent or their chemistry, remain somewhat of an enigma. How they perform depends on their cohesiveness as a unit. If Walker can find a way to spread the ball and let Tatum and Brown create on the wings, the team might have the beginnings of a well-rounded offense. If Hayward can contribute effectively without detracting from the development of the young core, he could prove to be a valuable piece in a proficient unit. If the young rookies like Romeo Langford, Carsen Edwards, and Grant Williams can anchor the bench, the Celtics have the potential to thrive off of a strong supporting cast.\nPersonally, I believe the Celtics will succeed this season. While Kemba Walker is no Kyrie Irving, he was selected to the All-NBA Third Team last year. He averaged over 25 points per game, and to date, he’s never had the chance to lead a potential contender. In an environment rich with talent that might draw defensive attention, Kemba has an opportunity to really shine. In the NBA today, teams win or lose on the backs of their stars, and I believe Kemba can carry the Celtics.\nThe Boston Celtics are one of the most storied franchises in the NBA. In 2019, ten years after their last championship win, do they have what it takes to win 50 games, make a deep run in the playoffs, or even win a title? I think they do. Yes, Kyrie may be gone, and the spotlight might be dimmed, but I believe that Kemba Walker and the Boston Celtics will certainly be a team to fear heading into the 2019-2020 NBA season. \n", "caption": "", "credit": "R..HALTMAIER/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/celtics/Compressed_celtics.jpg", "headline": "Expectations for the New-Look Celtics", "writer": "Prem Prabhakar", "categories": "sports,", "more_options": ""}