{"article_content": "Despite sitting out the majority of his Upper year due to a shoulder injury, Connor Ding ’20 was voted Andover Boys Soccer Co-Captain at the end of last season. According to Head Coach Edwin Escobar, Ding’s energy and drive were evident even when he wasn’t able to play.\n“Every single day [last year], Connor would come and he would continue to train even though he was limited. While he may not have been able to play soccer, he would continue to run laps around the track, continue to check on the team to see how things are going,” said Escobar. \nAccording to Ding, he strives to make a good impression on his teammates by putting consistent effort into his play.\n“I try to lead by example,” said Ding. “It’s not always easy to know how to motivate each player individually, but by working hard each day, other players tend to feed off of that energy.”\nAs Co-Captain, Ding leads the team through his actions and attention to detail, according to teammate Ethan Hong ’22 and fellow Co-Captain David Wang ’20.\n“He leads by doing what needs to be done,” said Hong. “He lets his actions do the talking by doing the little things right. He is a vocal leader on the team, but people don’t give him nearly as much credit for what he actually accomplishes on the team.”\n“He’s a good model to follow. He’s a good student and he leads by example. He’s reserved but he does most of his [work] without saying anything,” added Wang.\nAs a Senior on the team, Ding has helped the team succeed through the way in which he exemplifies the ideal student-athlete, according to Escobar.\nEscobar said, “I think that [Ding] has shown to be a student-athlete that can balance things really well. I think he’s an exceptional student and he plays soccer at an exceptional level. And to be able to do both things is something that young student-athletes look at and see it as a reference ... if you’re looking at Connor Ding, you’re looking at a complete student-athlete.”\nAccording to Hong, Ding prioritizes inclusivity and communication to create a tight bond.\nHong said, “I think he helps by reaching out to players who aren’t really as close with the rest of the team. We are trying to establish a family on this team, and I think Ding is a great example of how we want to act by welcoming new guys.”\n“He’s a pretty easy guy to talk to. I think he knows how important communication is, and that’s what makes him a great leader,” added Escobar.\nAs center back, Ding combines a high level of skill with composure to lead on the field, according to Escobar.\nEscobar said, “I think what Connor brings to the team is a level of calmness. When he has the ball, everybody feels comfortable that what he’s going to do with it is going to be something positive. So I think he brings a great level of positivity to the team and because of that, everybody takes the field with a lot more confidence.”\nAccording to Ding, he works to create both a fun and competitive environment at practice.\n“I try to be a vocal leader on the field, but off the field I’m pretty laid back and like to have fun with my teammates,” said Ding. “I work hard every day in practice, but I also want to make practices fun. I think a healthy amount of competition at practice each day is good for a team.”\nAccording to Escobar, Ding sets his priorities straight and has an innate ability for leading.\n“He knows very well that what he does off the field is equally as important as what he does on the field. He leads by example, on and off the field,” said Escobar. “He lets all of his work do the talking and he’s been a consistent leader throughout the time that he’s been here with us.”\n", "caption": "Co-Captain Connor Ding ’20 won the Mass US Club State Cup last May.", "credit": "B..MCKEE/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/connor/connording.bmckee.JPG", "headline": "Co-Captain Connor Ding ’20 is a “Complete Student-Athlete”", "writer": "Luke Boshar", "categories": "sports,", "more_options": ""}