{"article_content": "Sprinting past the opposing defensive back, Co-Captain Jake Jordan ’20 hauled in a 21-yard touchdown pass from quarterback Julio Dahl ’22, giving Andover a 7-0 lead after just its fourth offensive play. The team’s combined efforts led Andover Boys Football to a 32-7 win against Worcester last Saturday, moving its record to 1-3.\nAndover’s goal was to get off to a strong start in order to control the flow of the game, according to Dahl.\n“We wanted to start off quick, which we did, and drive the score up early so that they would have to play catch up. We wanted to force them to switch up their game plan so that they would focus more on trying to pass. Worcester’s team isn’t very good at passing; they’re more of a running team, so by running up the score early on, we put them in a tough predicament,” said Dahl.\nAccording to Head Coach Trey Brown ’12, the victory, his first-ever as head coach, was the result of strong team play, both offensively and defensively.\nThe offense was led by Dahl, who delivered 247 passing yards and three touchdowns in his first start. Jordan was on the receiving end of two of Dahl’s touchdowns, and Troy Pollock ’21 led the Andover rushing attack with 49 yards and one touchdown.\nOver the past few weeks, Andover has been working on playing as a single unit and trusting in each other, which made a difference in the team’s play, according to Danny Ferris ’22.\nFerris said, “I think our losses before this game made us realize that we had to come together as a team to win and the coaches did a really good job in terms of team bonding during practice… Moving forward, we want to keep playing as a team and get out there and play for each other.”\nAccording to Jordan and Nick Thomas ’21, this win helped boost the team’s morale and unite the players.\n“Working for two weeks and coming out on top instilled a new sense of unity among the players on the team. Seeing the positive results after two weeks of hard work really is the best feeling knowing that we all managed to dial in despite the losses at the beginning of the season and do our jobs every single play,” said Jordan.\nThomas wrote in an email to The Phillipian, “This feeling of all of us coming together and winning is unmatched. We’re a team that is seen as a non-threat, but we’re here to prove everyone wrong.”\nFootball will face Suffield at home this Saturday.\nEditor’s Note: Jake Jordan is a Live Editor for The Phillipian.\n", "caption": "Andover scored 26 points in the first quarter against Worcester Academy.", "credit": "D. ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/fball/Compressed_dzhu.football.06.jpg", "headline": "Andover Football Earns First Win of the Season", "writer": "Kiera Suh", "categories": "sports,football,fall-sports", "more_options": ""}