{"article_content": "With five top-ten finishes including a first place win from Chris Ratcliffe PG’20, Andover Boys Cross Country defeated St[a][b]. Paul’s in its second dual meet of the season. With a win of 25-30, Andover’s dual meet record now stands at 2-0. \nThis meet featured the biggest group of Andover runners racing this season, according to Head Coach Patrick Rielly.\n“We had more than 30 compete, many wearing the blue for the first time, and based on the results, we're in a great spot as we look toward the rest of our season,” Rielly wrote in an email to The Phillipian.\nAlthough Andover was missing some of its top finishers, its depth led the team to its victory.\nWilson said, “I think we saw some stiffer competition than we thought we’d see. We were missing some of our top runners too, due to injury and various reasons, so it’s good practice knowing we have a solid squad—that we can have a race even if we’re missing one or two of our top guys.”\nWith a large lineup of new runners for this race, the team bonded significantly during the trip to St. Paul’s, according to Will Sheehy ’22 and Jack Wilcox ’22. \n“I think our team came together at this meet because we had a lot of new runners there. On the bus ride back, everyone was talking to each other, so it felt like a complete team,” said Sheehy.\nWilcox said, “We were all nervous, but also excited. We were all really hyped for each other. After the race, when people PRed or got a good time, everyone would give them pats on the back.”\nDespite Andover’s win, the course proved more challenging than anticipated, according to Harrison Wilson ’20.\n“I always describe the St. Paul’s course as being quite windy; there are a lot of twists and turns that kind of slow it down even though it’s a relatively flat course. It’s good practice for our Interschols race, just because it has some undulating[c] hills and some wooded sections that require some mental toughness,” said Wilson.\nAccording to Wilson, the team needs to work on pacing the race better, and saving its energy for the last leg of the course.\nWilson said, “Next week, I think we need to strengthen our last mile of the race because we’ve been good at establishing ourselves in our first half of the race… I think what’s gonna get a lot of teams at Interschols or at bigger meets is our last mile, and if we can really solidify a really strong fast last mile with a strong kick at the end, I think we’ll be able to be a stronger team.”\nThe team will next race the 2018 Nepsac Champion team, Northfield Mount Hermon, during Andover’s Family Weekend for its first home meet of the season. \n \n", "img_path": "nophoto", "headline": "BXC Outruns St. Paul’s During Second Dual Meet of Season", "writer": "Tiffany Tang", "categories": "sports,,featured", "more_options": "--post_date='2019-10-19 16:06:55'"}