{"article_content": "Attendees thumbed through brand new copies of “Into the Blue” as students shared their stories from the collection. The “Into the Blue” launch party, held on Friday, October 11 in the Freeman Room, celebrated Out of the Blue’s (OOTB) second project with live student readings and free copies. \nA student-written collection, “Into the Blue” has been in the works for two years and consists of written and visual pieces pertaining to identity. According to Karen Sun ’20, a board member of OOTB, “Into the Blue” continues the goals of “Out of the Blue,” OOTB’s first project from 2015. \nThough the two works share similar themes, OOTB decided to restructure “Into the Blue” to reflect the intersectionality of identities.\n“ …This book was actually inspired by some issues we had [in the] last book because the last book was sectioned by identity. And we realized that that was in violation of a lot of values we had concerning intersectionality, and so we wanted to make this an intersectional book. So instead of having chapters and sections by identity, we switched it up to have it in states of recognizing your identity and order to celebrate all the different types of ways we connect with who we are,” said Sun. \nSabrina Codrington ’21 wrote an essay for OOTB, “How to Successfully Be Black on a White Campus,” that she shared at the launch party. Codrington believed that the live readings gave readers a different experience than the one they would have had by reading the piece on their own.\n“I feel like a lot of people wouldn't really see people having these experiences at Andover, and it's really easy to stay in your own little bubble, but once you read these branches in the book you see that Andover’s so much bigger than just yourself,” said Codrington. \nIn addition to recognizing new identities, communities, and experiences, some audience members connected with the stories on a personal level. Ben Perez ’23 related to a piece by Ashley Alvarez ’20[a] that resonated with parts of his own identity. \n“I could connect to it a lot. I'm Salvadoran and… she’s half-Mexican half-Salvadoran. I could connect to some [of] the language barriers and stuff like that as soon as they started talking, so hers is just one of the stories I resonated with,” said Perez. \nApart from giving students the opportunity to share their perspectives, OOTB aimed to educate readers and audience members about the ways in which identity plays a role into each person’s Andover experience. Sun referred to the final chapter, “How to be an Accomplice,” as one example of the collection giving helpful and practical information to readers. \n“We tried to make it more educational… and thinking more about one and not only how we individually reconcile with our oppression, but also how do we reconcile with our privilege, and how do we turn that into a mode of education,” said Sun.\nDerek Curtis, Programming and Digital Content Producer for the OWHL, is a faculty advisor for OOTB. Curtis appreciated the accomplice chapter of the collection because it prompted readers to stand in solidarity with their peers and community members. \nAccording to Curtis, “Into the Blue” reflects the ways in which Andover’s community members interact with each other, and he believes that these efforts are imperative to solving issues of equity and inclusion on campus. \n“Andover has traditionally been a school that has served a particular set of students, primarily white, and well to do. It's been a hetero-normative place. And we are now in the process of making the school much more equitable and much more inclusive space. And this work here that the students are doing and the students do throughout the year this is kind of a capstone publication in a way. But the work that the students do here is kind of crucial to the much larger work that's going on to make Andover a place that feels like a community for everyone in here,” said Curtis.\n", "img_path": "nophoto", "headline": "“Into the Blue” Collection Promotes Conversations About Intersectional Identities", "writer": "Dori Rosenstrauch", "categories": "news", "more_options": ""}