{"article_content": "\n\nTo the rhythmic beats of Drumline, laughs and cheers of new and returning students alike filled Cochran Chapel, with chants of  \"2020\" echoing throughout the pews. On Friday, September 13, students sat in on the All-School-Meeting (ASM) of the 2019-2020 school year, kicked off by the international students' flag-bearing procession, a faculty procession, and the annual entry of the Senior class. \nThe ASM featured student speeches given by Co-Presidents Sebastian Romero '20 and Shahinda Bahnasy '20, as well as new international students Gaia Dolenc-Bueno '22 and Jason Zhang '23. Each of the speakers shared their personal remarks on the start of the 2019-2020 year. Additionally, Alianza Latina Co-Presidents Daniel Dominguez '21 and Ashley Alvarez '20 spoke about the implementation of Phillips Academy Latinx Heritage Month, which will run from September 15 to October 15.\nAs a new student this year, Andrew Falcon '22 was excited to see the high energy that was set for the start of the school year. Falcon expressed how seeing the Seniors walk through the Cochran Chapel halls provided him a moment of reflection. \n\"I thought the ASM had really great energy, and watching my Senior proctors walk down the aisle was something very interesting to see. It is amazing to think that I will be in their shoes in only two years,\" said Falcon. \nRomero and Bahnasy emphasized the importance of forging meaningful relationships and seeking support from one another in order to have a successful Andover life. \nIn her speech, Bahnasy said, \"When I first came in as a Junior, I made it a goal to recognize and name every student on this campus. I failed my Junior, Lower, and Upper year. This year, my last year at Andover, is my final chance. I am sharing this with you because I want all of you to do the same. We all go to classes together, eat in Commons together, and attend ASM together. Imagine how much more inviting this campus would be if we all knew the names and faces of everyone in this room.\"\nRomero echoed Bahnasy's sentiment, explaining that at a time of major new changes to the schedule and faculty, it is crucial to rely on each other for a smooth transition. \n\"We are attending Andover during times of new beginnings. In these times, it is important to stick together. Nobody expects any of you to adapt to this new school year seamlessly. But if we help each other and lend a hand, we will be able to make this transition as easy as possible. We want you to be supported in moments of vulnerability. Our hope is for you to take the next step, being outside of the box and taking that risk,\" said Romero.\nDolenc-Bueno and Zhang shared their own perspectives on the opening of school. While they agreed with Bahnasy and Romero on the points of unity and meaningful relationships, they were able to emphasize the international aspect of being a new student by touching on their personal experiences.\nDespite her short time at Andover so far, Dolenc-Bueno shared her thanks to friends and support systems that helped her quickly adjust to a new environment. She plans on embracing different opportunities and experiences in the future as well. \n\"The special part about Andover is that there [has been] a support system since the moment I arrived on campus. From [New International Students Orientation] which has been extremely helpful in adjusting to the school and allowed me to meet many people even before the start of school, and my dorm and cluster, I find comfort in all different parts of the school,\" said Dolenc-Bueno.  \nShe continued, \"I feel like everyone here, especially my friends, want each other to succeed. They are rooting for us, and they also understand that we are human and we cannot be the best versions of ourselves everyday, especially when teenage mood swings and emotional breakdowns occasionally come into play. I plan on living up to the support given by everyone.\" \nZhang expressed his gratitude for all students and faculty who helped him integrate into the Andover community.\n \"On the first day of school, I encountered a returning Lower. Although I could immediately see the look in his eyes shift when hearing that I was a new Junior, he kindly patted me on the back and with his smile, he provided me with so much advice and encouragement. For the past two weeks, the overall hospitality of the community has made me feel truly welcomed,\" Zhang said. \nBuilding off the idea of seeking support from others, Interim Head of School Jim Ventre '79 concluded ASM by explaining that the advice he received as an Andover student ultimately guided him in becoming the person he is now. Using a personal anecdote, Ventre encouraged Andover students to do the same for the upcoming year. \nVentre said, \"We have an extraordinary combination of people, mission, and principles. Our school of people brings joy together, with the help of one another. My Andover story is all about the people who helped me. Sticking together is the only way through, the only way to feel confident and safe while bringing out the best in one another. If I didn't follow the advice given by the helping adults around me, I would not have been able to stand here at this moment today.\"\n", "caption": "Student body Co-Presidents Sebastian Romero ’20 and Shahinda Bahnasy ’20 encouraged students to form meaningful relationships with friends and seek support from their peers.", "credit": "T.WEI/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/news/asm/Compressed_twei.sebnsho.1.jpg", "headline": "Opening of School ASM Highlights Changes and New Beginnings", "writer": "Aaron Chung", "categories": "news", "more_options": ""}