{"article_content": "\n\nAndover Girls Volleyball traveled to St. Paul’s this past Friday and suffered its first loss of the season, losing its undefeated title. The team fell 3-0 (21-25, 20-25, 24-26). The loss, coupled with another loss against Phillips Exeter Academy, brought the team’s record to 9-2. \nAccording to Adaeze Izuegbunam ’20, the team had difficulty adjusting to the Friday game time which was different than the usual Saturday and Wednesday game days. This switch which was necessary to accommodate to St. Paul’s Family Weekend. \n“We typically don't play on a Friday… we just had to sit on the bus, and I think overcoming the… mental block of this isn't what we are used to. [We had] to rebuild the on court chemistry,” said Izuegbunam. \nThe St. Paul’s team had unique offensive players, forcing Andover to adjust its hitting and defense, according to Ridley Warner ’22. \nWarner said, “We needed to get used to the defense, since they were hitting us short balls instead of longer balls that we are used to. Getting to the shorter balls is definitely something we can work on more.”\nAn additional difficulty the team had to face was the absence of several starters and a consequent lineup adjustment, according to Captain Chioma Ugwonali ’20.\n“Our team dynamic was a little off because we played with a new rotation that we had not practiced much before. It was difficult to keep our spirits up while adjusting to St. Paul’s skilled offense and our single block on the outside, ” said Ugwonali.\nAlthough the team ultimately lost, Andover made a comeback in the second set and secured a 6-1 lead as a result of crucial saves from setter Sarah Chen ’21 and Izuegbunam, according to Ugwonali. \nUgwonali said, “I am incredibly proud of Sarah Chen, who set the entire game and made some phenomenal saves. Sarah also scores many of our points through her powerful serves. \nAdaeze Izuegbunam made a beautiful left hand strike towards St. Paul’s setter, who was unable to dig the ball in time. Adaeze’s play helped boost our morale.”\nAdditionally, Andover lost 1-3 against Exeter this past Wednesday. Despite this loss, the team demonstrated strong serve-receive skills, according to Michelle Brunetti ’23. \n“The hardest thing to overcome this game was getting the frequent tips and hard hits from the outside, [but] in practice we have worked a lot on serve-receive, which showed in the game,” said Brunetti. \nAndover will next face Northfield Mount Hermon at home for Parents’ Weekend this Saturday. \nEditor’s Note: Sarah Chen is a Digital Editor for The Phillipian.\n\n\n", "caption": "Warren Clark ’21 is a starting Right Side Hitter and joined the team last year as a new Lower.", "credit": "S..BAHNASY/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/volleyball/sbahnasy.volleyball.0004.JPG", "headline": "Andover Girls Volleyball Suffers Back-to-Back Losses", "writer": "Emily Kelly", "categories": "sports,girls-volleyball,fall-sports", "more_options": ""}