{"article_content": "Artificial light poured out from the third floor of the Gelb Science Center, accompanied by the dim glow of the full moon. Dozens of mooncakes were laid out on two large tables by a long line of people who chatted as they waited by the stairs leading to the observatory. Students, dessert in hand, waited to get a closer look at the moon through the giant telescope.\nLast Friday, the Astronomy Club and Andover Chinese Student Association (A.C.S.A.) collaborated to host this festive event, during which many members of the community came together to celebrate the Mid-Autumn Festival.\n\"The night was really successful; the line was so long that I couldn't believe my eyes. So many people were 'wow'-ing at the moon and I am very impressed by just how responsive the community is and how much they are willing to participate in a cool event on their Friday night,\" said Faye Yu '20, Co-Head of both Astronomy Club and A.C.S.A.\nThe Mid-Autumn Festival is a traditional Chinese holiday dedicated to the legend of a young girl who became a goddess and flew to the moon. Eating mooncakes and going moon-gazing are traditional celebrations for the Mid-Autumn Festival.\n\"The Mid-Autumn Festival is a Chinese celebration that we do in mid-autumn. It comes with a lot of different myths. This is a big celebration in China, and there we get days off of school, so as part of A.C.S.A. I just really wanted the [Andover] community to be aware that this is a festive season,\" said Yu. \nMaxwell Bao '20, Co-President of A.C.S.A., hopes celebrating festivals such as the Mid-Autumn Festival will encourage students to celebrate traditional Chinese holidays on campus.\n\"We believe that there are a lot of events or celebrations in China, such as the Mid-Autumn Festival that... is very hard, especially for boarding students, for them to celebrate. I think these festivals help people come together as a family and do customary things like looking at the moon or eating mooncakes,\" said Bao.\nThe Moon Festival provided students with an opportunity to explore the observatory, experience a part of Chinese culture, and learn more about astronomy. One participant, Jay Pae '23, noted the difference between his telescope at home and the one in the observatory, and how it impacted his outlook of the world. \nPae said, \"It was an opportunity for me to see how they produce ultra-high definition images of outer space, especially the moon. I learned that outer space can be very beautiful if you use the right equipment. If you go to the right place at the right time, you can get some good photos and have a great time.\"\n\n\n", "caption": "The event was hosted in the observatory to give students a chance to\nview the full moon. ", "credit": "O.TUNG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/arts/moonfest/otung.TONEDCOLOR.moonfestival.jpg", "headline": "Clubs Partner to Celebrate Moon Festival", "writer": "alex park and noemi elliott", "categories": "arts", "more_options": ""}