{"article_content": "\n\nFor many students at Andover, a single question looms overhead: where am I going to go after I graduate? Starting at the beginning of Lower year, the College Counseling Office (CCO) assists students through the process of applying to colleges. Counselors operate under one main idea: understanding students and their interests before finding colleges that suit them, according to Sean Logan, Dean of College Counseling.\n\"[The process is] not, 'Here's a bunch of good schools, which ones do we put on your list, which ones do I fit into.' We're going to say to students, 'That's not how we do it.' We start with getting to know you and figuring out things you might want, and also help students use search engines and help them figure out how to do it,\" said Logan. \nThere are currently thirteen college counselors, with students assigned to each. Student groups are intentionally diverse and representative of the greater Andover community. While each student works with their particular counselor, they also receive input from the collective power of the office.\nLogan said, \"Philosophically, we want every counselor to have a microcosm of the Andover population. What that means is that we don't have specialists. Everybody in this office should be able to work with any type of individual that's here. We do a process, then, that is actually pretty random.\"\nAraba Aidoo '20 feels that she has developed a strong bond with her college counselor and encourages students to remember that they know what is best for themselves.\n\"Personally, I have a great college counselor. We're always in communication, he tells it to me straight like it is. There's no bluffing, there's no sugar-coating anything. He's always available which I really love... I think it's important to note that your college counselor is there to advise, you are the only person that knows what's best for you, so if you feel like you have to stray course from your college counselor, I think that's fine too,\" said Aidoo.\nBy engaging in a variety of writing exercises and meetings with their counselor in an effort to reflect and understand themselves better, students take a step back and learn what they look for in a college. \n\"Reflection is a very important part of college counseling: getting Andover kids out of that groove of 'what's next in my life,' going a hundred miles an hour with hair on fire in the forward direction, and stopping and turning around and saying, 'What have I just done? What am I good at, what am I not so good at, what do I like about Andover, what don't I like about Andover?' Really getting them to think long and hard about the choices they've made and things that have helped them be successful here, and really using that to look forward and say 'What do you think you might need in your next four years?'\" said Logan.\nSam Sheehan '20 appreciated the college counseling process for helping him plan for his college applications. He also thinks the process could benefit from more individual, in-person discussion.\nSheehan said, \"We established a plan for me to get work done for college, which was very helpful because even if I wanted to, I would have not been able to do it over the summer. However, I think the group meetings for college counseling were not as useful; the time would be better spent individually. In addition, I don't know if the surveys are very efficient. I think that stuff would be better talked about in person.\"\nThe CCO staff is constantly in professional development, continually visiting colleges and updating information during college fairs, according to Logan. They are also aware of issues present in higher education that may affect the college counseling process in the coming years, such as the Varsity Blues admissions scandal, and adapting to those circumstances. \n\"In fact, our own admissions office and the College Counseling Office do our own internal reviews about what we do and we stay at the highest ethical standards we can stay to. Colleges are doing the same things,\" said Logan.\nDuring the college application process, students should strive to be academically well-rounded and be their own self-advocate. However, Logan also acknowledges the stress from outside sources and the publicity of the application process. \n\"This is one of the downsides of being at an amazing place at Andover: everyone's applying to college pretty much at the same time. Everyone knows Seniors are applying to college, so it raises that level of not only stress, but also of the public piece in it. So we really work with kids about how to deal with that,\" said Logan. \nLogan encourages students to with Andover in an \"honest and genuine\" way, rather than worrying too much about the future. \n\"Let's not worry about what we can't control, but really stay focused on Andover, because I do think this is a really unique high school experience. Not better or worse, but unique... I think one of the reasons why Andover students do very well in the college process is because they bring such a different perspective to a school because they have already lived in an intentionally diverse community for one, two, three, four years. That's pretty rare,\" said Logan. \n\n\n", "img_path": "nophoto", "headline": "Behind the Scenes: College Counseling at Andover", "writer": "Will Yue and Laura Ospina", "categories": "news", "more_options": ""}