{"article_content": "Andover Girls Cross Country’s fastest racer for the second week in a row, Natasha Muromcew ’22, crossed the finish line with a time of 20:41 minutes, contributing to Andover’s 16-46 win over St. Paul’s this past Saturday.\nCompleting a first through fourth place sweep behind Muromcew were teammates Izzy Alvarez-Martinez ’23 with a time of 20:57 minutes, Tiffany Tang ’22 with a time of 21 minutes and 8 seconds, and Tessa Conrardy ’20 with a time of 21 minutes and 24 seconds. According to Ava Sullivan ’23, the flatter St. Paul’s course presented a new challenge to the team.\nIn an email to The Phillipian, Sullivan wrote, “A key takeaway from this meet is adjusting to the change of speed when it comes to a flat coarse like this one. During the races we have had this season, there have been at least two significant uphills which require a slight pace change, but also some long and steep downhills which help with speeding up. At St. Paul’s, the course didn’t have much of this change in elevation, which called for a different type of racing strategy and pace compared to what I had been used to.”\nThe team focused on using pack running to its benefit, helping to motivate each other throughout the race, according to Muromcew.\n“Something notable is that our first five girls had an average time of 21 [minutes and 9 seconds] and we were all within one minute of each other…One thing that helped [the team] is our pack running. We’ve really hit a spot in which we can all race together or near each other, and that helps us push ourselves and each other further than we might expect,” wrote Muromcew in an email to The Phillipian.\nAlthough the team lost five of its top runners from last year, it has bounced back this season with the help of newer runners, according to Muromcew.\nMuromcew continued, “I think that we’ve had a little bit of a rough start since we lost our top five runners from last year, but we’ve recovered with the help of some of the new runners. Some runners in specific would be Tiffany Tang, Izzy Alvarez-Martinez, Maya Tang [’23], and Ava Sullivan. They’ve been performing so well this season, and I think that they also show a lot of promise for a strong team in years forwards.” \nIn preparation for its first home meet of the season, the team will study and train on the Andover course during practice, according to Kate Pfister ’21.\n\n\n“Since our next race is home, we’ll probably spend a lot of this week focusing on our own course and how to run it. Our team in general made a breakthrough this week with some of our fastest times of the season, and we had some injured runners getting back into racing again which was great,” wrote Pfister in an email to The Phillipian.\nThe team will race Northfield Mount Hermon at home this Saturday.\nEditor’s Note: Tessa Conrardy is President of The Phillipian.\n", "img_path": "nophoto", "headline": "", "writer": "Justin Hardy", "categories": "sports,", "more_options": ""}