{"article_content": "At the beginning of September, Hurricane Dorian swept through the Bahamas, leaving a trail of death and destruction in its wake. Over a thousand people were reported missing, and the reported death toll climbed to 50 as of September 15, according to a report done by the United Nations (UN) Office for the Coordination of Humanitarian Affairs (O.C.H.A.). \nMost affected by the hurricane was the Great Abaco Island, where the nonprofit organization Light and Hope will send resources and supplies. Founded by Salvador Gomez-Colon '21, Light and Hope was initially created to provide relief for Puerto Rico after the devastating effects of Hurricane Maria in 2017. \nGomez-Colon, an Upper class representative, has partnered Light and Hope with Student Council to run a fundraising initiative focused on raising money to purchase supplies that would then be sent to the archipelago. Gomez-Colon explained how he hopes to replicate the model of Light and Hope that originally worked in Puerto Rico.\n\"Light and Hope was an initiative that I started in Puerto Rico... the model was that I'd raise money to purchase and distribute solar lamps and hand powered washing machines to the most affected communities around the island. So later on for Puerto Rico, [we] ended up raising over $170,000. We distributed...4,100 lamps to over 3,500 households,\" said Gomez-Colon. \n\"I knew that [lamps and washing machines were] necessary, but that big organizations were not going to be focusing on [them]. So they're going to be focusing on food, on water, on shelters, right? And I want to do something that I knew that I could, as a 15 year old, that I could pull through, but also that was that was touching, was important, was needed,\" continued Gomez-Colon.\nDr. Nikki R. Cleare P'19, Instructor in Mathematics, Statistics, & Computer Science, is from and has family living in the Bahamas, some of whom were directly affected by the hurricane. While all of her family members were unharmed, Cleare described how the water surges that have been destroying homes and property put several of her own family members' lives in danger. \n\" Thankfully, all of my family are safe. One of my cousins who lived in Freeport lost her home and, because the hospital in Freeport was destroyed by the 20 ft water surges, she had to be airlifted to Nassau by helicopter for an emergency surgery that she needed. My other cousins who live in Freeport lost their family business, and my family in Abaco have relocated to one of our southern islands, Inagua, to live with family there,\" wrote Cleare in an email to The Phillipian.\nHowever, Cleare also explained how some others were affected by the hurricane more severely. \n\"Some of my friends were not as fortunate though and tell stories of little children watching their grandparents get washed away by the 20ft water surges as they clung to their parents for more than 36 hours waiting for the storm to end and help to arrive,\" wrote Cleare. \n\n\nThe Bahamas' relief initiative was announced last Friday at All-School Meeting (ASM) by Co-Presidents Shahinda Bahnasy '20 and Sebastian Romero '20. \nRomero explained how the fundraising effort at Andover was somewhat inspired by a campaign that also focused on Hurricane Maria relief that he ran two years ago. The previously-existing infrastructure that he had established coupled with Gomez-Colon's nonprofit presented itself as a solution for real, tangible change. \n\"So I ran a campaign similar to this when I was a Lower. And we actually did the same thing with Mr. Palfrey and Ms. Elliot. So I reached out to them back then and we organized it. But now with the platform that I had, and actually Salvador, who actually has this nonprofit running and that he actually did the same recuperation efforts but back in Puerto Rico. He took the same platform and I took what I had. And what we did was using Student Council, we met with Mr. Ventre and Ms. Elliot. And using that, we quickly got to converse, they quickly got on board and they were more than enthusiastic to join us,\" said Romero.\nWhile Romero's initiative lower year involved pieing former Head of School John Palfrey P'21, '23 and Jennifer Elliott '94, P'22, Assistant Head of School for Residential Life and Dean of Students, the Light and Hope for the Bahamas fundraiser is seeking different approaches. It will sell bracelets for the whole of this upcoming week in Paresky Commons to raise awareness and donations. \nCleare emphasized her appreciation for the immediate reactions of care and concern that she received from the Andover community, noting the importance of reaching out to others and of selflessness, especially in times of crisis and need. Cleare recognized how the efforts of Bahnasy, Romero, and Gomez-Colon were concrete ways of showing that kind of selflessness and empathy.\n\" In the days during and since the hurricane, several of my close colleagues and some of the students I have taught at Andover have reached out to me to share their concern and support.  Just knowing others care makes a difference -- so please don't forget to always take time for each other. That was part of the message Keely Aouga '18, one of last year's Co-Presidents, shared in her commencement address: Taking time to care for each other is important!\" wrote Cleare. \nCleare continued, \"I certainly appreciated when Shahinda, whom I taught two years ago, found me during the opening days of school to ask how I was doing and share her concern about the hurricane that, at the time, was still sitting over the Bahamas.  She found me again a few days later to tell me about the fundraiser that Salvador, who is from Puerto Rico, was organizing.  Although I am not aware of any Bahamian students at Andover at this time, there are lots of students like Salvador who know the lasting impact of a hurricane. Your support for the relief effort is a tangible way of showing that you care.\"\nGomez-Colon emphasized that fundraising for the Bahamas was especially important due to what he saw as a considerable difference in media coverage between Hurricane Dorian in the Bahamas versus Hurricane Maria in Puerto Rico. Because of that lack of media coverage and lack of visibility, Gomez-Colon expressed how he felt it was crucial that the desperate need in the Bahamas be recognized. \n\"In Puerto Rico, we have so many political tensions with the United States in laws and all that, so it's a hot topic .... Whereas for the Bahamas, the sad thing is that the narrative is 'just another natural disaster in just another Caribbean island or archipelago,' right? So it's not really isolated, it's not being identified, and the need isn't being recognized as much as it should be,\" said Gomez-Colon. \nEchoing Cleare's point, the Light and Hope fundraiser is a testament of how a student-led initiative can mobilize the entire community, according to Leila Hardy '22. \n\"I think this initiative is particularly great because it's helping real people who need this aid money, but I think in any situation where an Andover student needs help and the community is able to rally together in a way like this to support them, I think that's always wonderful and always strengthens our community,\" said Hardy. \nEditor's Note: Shahinda Bahnasy is a Photo Editor for The Phillipian.\n\n\n", "img_path": "nophoto", "headline": "Student Council Launches Hurricane Dorian Relief Initiative for the Bahamas", "writer": "Sophia Lee", "categories": "news,featured", "more_options": "--post_date='2019-09-20 14:28:04'"}