{"article_content": "The iconic bicentennial sculpture that once stood in the Richard T. Greener Quadrangle has recently been removed. \nIn an email to Andover faculty and staff, Larry Muench, Office of Physical Plant Facilities Director, explained that the statue will be reinstalled in Pine Knoll \"sometime in the near future.\"\nThe statue, completed and installed in 1978, was designed by Gerry Shertzer, former Instructor in Art, and commemorated Andover's bicentennial. \nBridget Santos '21 feels that while the relocation of the sculpture did improve the landscape of the Richard T. Greener Quadrangle, the sculpture's absence from the quad was surprising. \n\"It was an interesting piece, but I am glad that it was moved off the quadrangle because I feel like it disrupted the scene a bit. But it's a little strange not having it there, just because I got so used to it. I'm interested to see where it goes afterward, though,\" said Santos. \n\n\nThe Campus Design Review Committee decided that moving the sculpture would preserve the original campus landscape design. \n\"The plan's landscape elements, developed with input from the Olmsted brothers, emphasized simplicity, with minimal plantings and structures along with the building foundations and in open spaces. Over the past few years, the landscape has been edited back toward its original form...These projects align the campus landscape with the simplicity of those plans,\" wrote Muench in an email to The Phillipian.\nMany students refer to the bicentennial statue as the \"boner statue\" due to its phallic resemblance. Prior to its removal, the statue was surrounded by a circular bush, which some students believed represented a sexual act. \nThe phallic connotations, however, were not intentional. In a letter to former Head of School Barbara Chase dated October 11, 1995, Shertzer explained that former Head of School Ted Sizer commissioned him to design and make the sculpture as part of the school's celebration. \nShertzer drew inspiration for his sculpture, a contemporary seventeen-foot high piece comprised entirely of stainless steel, by reflecting on Andover's mottos.\n\"Creating an image based on an Abbot/Andover theme was not an easy task...[the Latin motto] 'Finis Origine Pendet' [ended up being the basis for the design]. The idea of a form evolving from an original form at the base was intriguing and in fact, became the concept of the present piece. Besides, it is such a marvelous theme for a secondary school,\" wrote Shertzer in the letter.  \nThe school used 15,000 dollars for the sculpture from the bicentennial budget: 12,000 dollars for the construction and installation and the remaining 3,000 dollars for Shertzer himself. \nLast year, the quad on which the statue was erected was renamed the Richard T. Greener Quadrangle, in honor of Andover's first African American alumnus. \nMuench said, \"The renaming of the quad and renovation of the [Oliver Wendell Holmes Library] gave us a chance to revisit [the] original plan and make appropriate changes, namely replacing the overgrown bushes in front of Pearson and relocating this sculpture.\"\nAlthough Irura Nyiha '20 misses the statue's central location on campus, he looks forward to Pine Knoll receiving some outdoor artwork. \nNyiha said, \"It's a beautiful work of abstract expressionism that really signified the heritage of this school. Many upperclassmen, Seniors especially, grew up with this statue, and it's really sad to see it gone, [but it will] brighten up the Knoll.\" \n\n\n", "caption": "After being removed this summer, the bicentennial statue is set to be reinstalled in Pine Knoll sometime in the coming weeks.", "credit": "A.KIM/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/news/cbstatue/Compressed_akim.catboner.TONEDCOLOR.jpg", "headline": "Bicentennial Statue Removed", "writer": "Will Yue, Zaina Qamar", "categories": "news,featured", "more_options": "--post_date='2019-09-20 14:28:03'"}