{"article_content": "Five months ago,[a] a pimple-faced[b], croaky-voiced teenager stepped tentatively onto this campus, armed with a notebook and a violently-pounding heart. During revisit day, I saw an Andover that was beaming with smiles--the Blue Key Heads chanted, jumped, and danced as students cheered along, looking right at home in their tutu skirts and rollerblades. It seemed upbeat to say the least, if not pleasantly bizarre. It was perfect. Somehow, it sparked an excitement that waxed and waned as summer flew by--an excitement that culminated in my first days of school, but would prove hard to retain.[c]\n\n\nUnfortunately, my excitement was quickly quashed with a deluge of disclaimers and Senior advice during my first week on campus. As hours gave way to days, countless complaints about the school flooded my mind, backlogging my thoughts and causing an emotional override that I tried desperately to suppress. New growing fears that I was going to flop and fail, a sickening dread of finding myself in an extracurricular dead end, dying of EEE, to name a few.\n\n\nSuch fears, particularly the last, clouded my vision before I could even form one for myself. I feared the \"stringent grading\" before I had met any teacher. As a new Lower in America House, I dreaded the long walk before I even stepped into my common room. I internalized every complaint I heard before I had even experienced the subjects they criticized. Completely oblivious to all the vitality, excitement, and beauty that made me #sayyestoandover in the first place, I became emotionally paralyzed. \n\n\nOne day however, I began to notice little things that, subtly, began to unveil to me the true nature of Andover, above and beyond the doubts that drove away my initial enthusiasm. One such thing is my little morning \"commute\".\n\n\nThe walk to and from America House proves much more bearable than what others claimed. In fact, I find it pleasant and have even devised many routes down Main Street, some of which involve no jaywalking. I have ventured into countless landmarks that I would never have found otherwise, like the small grove next to Cochran Chapel or the stone plaque dedicated to the 50th year reunion of the Class of 1942. Almost all of the locations pictured in the @andoveradmissions back-to-school countdown. Indeed, the walk has shown me a richness of history that extends so far beyond the stringent grader or extra minute of walking in the morning. \n\n\nThe walk is just one reason my days at Andover have been special. I realized there is so much more to this place than my first few days had cared to point out. Andover, as many on campus experience, is brimming with Big Blue school spirit. That has been proven to me through every interaction and every smile I give and see. Andover, at its core, is brimming with a spirit of vitality. A spirit of respect. A spirit of family. A spirit of home.\n\n\nComplaints, especially those directed towards the institution, are an integral part of any student's experience. We must learn to take a step back, take a deep breath, and appreciate all that we have. We all share a space that is dreamed of by students from all over the world. Though we may not always love it in every way, we all love it in some way. We should learn to show it more--most importantly by refraining from terrifying the next new Lower. The next new student, for that matter. Andover is a beautiful place, and the students are what make Andover special.\n", "img_path": "nophoto", "headline": "Phillipian Commentary: Summertime Reflections from a New Student", "writer": "Frank Zhou", "categories": "commentary", "more_options": ""}