{"article_content": "Tipping in a shot from Captain Carly Kreytak ’20, Anna Bargman ’21 scored Andover Field Hockey’s first and only goal against St. Paul’s. Bargman’s goal in the second half drove Andover to a 1-0 win last Saturday.\nAccording to Kreytak and Head Coach Kate Dolan, although the game was low-scoring, Andover was able to control the flow of the game in both halves.\nKreytak said, “I think that we did a good job keeping them in their zone. We were very close to scoring so many times… I think that it was a challenging game overall.”\nCoach Dolan added in an email to The Phillipian, “We dominated in terms of possession in our offensive half of the field.”\nEven though the team maintained a four-game winning streak, the team still believes it has room for improvement, according to Kreytak.\nKreytak said, “I think we have a lot more potential. Actually, our game last Tuesday against Milton Academy was really good, it was a good showing of how hard we are able to work and how much we want to win… But at St. Paul’s, I think that it was almost like a lull in our season, because even though we won, we definitely could have beaten them by a lot more. We just need to focus on being intentional in what we are doing and being hungrier to win.”\n“We can continue to improve, particularly with our communication, our ability to finish plays within our offensive 25, and passing the ball with greater consistency and strength,” added Dolan.\nAndover also visited Middlesex on Wednesday for a 1-0 loss, putting its current record at 8-2. According to Kiera Suh ’22, despite the close score, the team wasn’t able to make the necessary plays.\n“After this game, we’re realizing the importance of finishing, as well as the importance of playing as a team. Our midfield set up many crisp plays or passes into the circle that we weren’t quite able to put away. We also started to get quiet at the end of the first half which created a bit of confusion and discombobulation across the field,” said Suh. “We’re still trying to get our team chemistry right in order to define this year’s team. There’s a lot of small controllable things that we still aren’t doing consistently such as calling people off the ball or running hard into loose balls.”\nAndover looks to regain its winning streak against Northfield Mount Hermon at home this Saturday.\n", "caption": "Rachel Neyman ’22 is a midfielder for Andover Field Hockey", "credit": "D. ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/pafh/Compressed_dzhu.PAFH.0006.JPG", "headline": "PAFH Wins One and Loses One in Two Close Games", "writer": "Jay Aziabor", "categories": "sports,", "more_options": ""}