{"article_content": "This past Sunday, Andover Girls Cross Country traveled to Lee, N.H., to compete in its first meet of the season at Oyster River's Bobcat Invitational. Andover placed fourth out of 12 teams with a total time of 1:53:37, approximately five minutes after first place Phillips Exeter Academy.\nAccording to Captain Posie Millett '20 and Natasha Muromcew '22, Andover prepared for the meet by training in packs--a method employed by the team in order to push each other forward during practice.\nMillett said, \"One of the things we talked about a lot this week was distributing the effort, and so when you run with your pack and other teammates, if there is someone who's particularly apt at running hills, you let that person take it and your job is to hold on to them. When we have our pack mentality it really helps to get up the hill.\" \nMuromcew said, \"Pack running is definitely a goal and we work on it during training. I think it worked really well, I was pack running with [Claire De Saint Phalle '21] and [Tessa Conrardy '20] and then Posie and [Tiffany Tang '22] together, and since we were all fairly closer together, we were able to move ahead as a group from the other teams.\"  \nOne challenging aspect of the course was its hilly and rocky terrain, according to Tang and Muromcew.\nTang said, \"The course was kind of rough, and I think it was a lot hillier than what any of us are used to. It was also pretty hot out that day, and I think that along with all the hills definitely slowed us down a little. The times overall weren't super fast because of how hard the course was.\"\nMuromcew added, \"We were running on dirt roads with rocks and that was tricky for some people, especially me because I had spikes.\"\nDespite the humid weather conditions, the team managed to keep its energy high by staying hydrated, according to Millett.\n\"It was tough because it was cold in our training for September, we hadn't run yet in a day that was so humid. We had a big emphasis on hydration. We had a lot of people feeling dehydrated and dizzy, but overall making sure everyone stayed healthy and comfortable and only using however much effort they had,\" said Millett. \nAccording to Millett, the team enjoyed running through an apple orchard, a change in scenery from its usual campus course. \nMillett continued, \"Running off campus in a place where it was public terrain was really fun. After their were families picking apples and it was really cute. It was a nice change of scenery.\"\nAndover will compete in the Northfield Mount Hermon Invitational this Saturday. \nEditor's Note: Tessa Conrardy is the President of The Phillipian.\n", "caption": "The apple orchard course at the Bobcat Invitational differed from traditional campus courses.", "credit": "C.WAGGONER/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/gxc/Compressed_cwaggoner.GXC.02.jpg", "headline": "Girls Cross Country Places Fourth in Bobcat Invitational", "writer": "Sarah Karlen", "categories": "sports,girls-cross-country,fall-sports", "more_options": ""}