{"article_content": "In a game where neither team led by more than two goals at any given moment, Andover Boys Water Polo ultimately fell to Suffield 14-13 on Wednesday.\nMathis Weber ’20 said, “We started off the third quarter with a lot of energy and we were running them down. They were a small team and they got pretty tired pretty fast. We ran them down and scored two goals in two minutes. The only problem was that we weren't able to keep that lead because [their player] came back and shot.”\nNico Madrid ’20 said, “Everyone rose to the occasion and everyone had their moment where they scored a goal in a clutch situation, tying up the game — that happened multiple times.”\nBoth teams entered the game with the same record. Knowing this, Andover went into the game with high intensity, according to Zach Hooven ’22.\n“They had a really similar playing style to us and they were very similar to us in skill, so we knew from the beginning that the game was going to be very close… It didn't go in our favor but with a team like that, you have to defend them well. They have a couple of strong players you have to keep an eye on and have to be able to dominate against them offensively,” said Hooven.\nOffensively, Andover did its best to keep up with Suffield’s scoring, but Suffield’s fast-breaks were difficult to cover, according to Weber. \n“When they actually set up, we were able to [play strong defense], so they didn't score that much when they were set up. The only time they actually scored on us was during the fast breaks,” said Weber. \nAgainst Suffield, Andover’s starting line played for the entirety of the game. In the weeks to come, Andover hopes to expand its roster of versatile players and work on those players’ positioning in the pool, according to Sean Meng ’22 and Hooven.\n“I think we need to keep doing some position work. The starting line up is pretty much set, with their abilities we can make it to the playoffs, but with some of the substitutes like myself, we're still working on specific positioning, training ourselves so that if something does happen, or a player gets tired during the playoffs, we are able to come in and replace them,” said Meng.\n“We could've functioned better as a whole unit and I think part of it was that we were really tiring out our starting guys; they had a lot of work to do and I think they were lacking in conditioning,” said Hooven. \nAndover will play St. John’s Prep at home this Friday. \nEditor’s Note: Sean Meng is a Business Associate for The Phillipian.\n", "caption": "", "credit": "E..ELLSWEIG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/bvwopo/eellsweig.BVWOPO2.JPG", "headline": "Andover Ends Winning Streak After Loss to Suffield", "writer": "Cassidy Sadowski", "categories": "sports,", "more_options": ""}