{"article_content": "The most famous song by Cheryl Tugade ’21, “Backseat,” which was produced by Filipino music label FlipMusic, has over 100,000 plays on Spotify.\nTugade grew up playing piano and guitar, and started singing and songwriting in the seventh grade. She has since signed with FlipMusic, and has released five singles on Spotify. “Backseat”is featured on Spotify’s “Road Trip” playlist, which has nearly 250,000 followers, and New Music Friday Philippines, which has over 600,000 followers. \n“[When] I started writing songs… I didn't really show them to anyone. And then one day I showed one of the songs I wrote — which I'm actually going to perform at Grasshopper— and then people liked it and from there I was like, ‘ok, maybe I can sing,’” said Tugade. \nSigning with a record label has allowed Tugade to produce music with a more professional and higher quality audio. In addition, Tugade’s work with a producer has allowed her to create more complex sounds behind her vocals, which impressed her friend Martina Gil-Diaz ’21.\n“The first song I heard that she made had a rainforest-type background at the beginning, and that's something that you don't really hear in a lot of pop songs... and I [thought], ‘wow, this chick does something cool and different,’” said Gil-Diaz ’21.\nAccording to Tugade, her songs examine the smaller moments in life, but expand on them and explore her feelings during them. Many of her songs also discuss more serious topics, such as mental health.\n“There's a song I wrote called ‘Not Alone’ that was nominated for an award in Singapore, but it was actually written for a friend experiencing mental health [issues]. I would say I'm not limited to writing about [mental health], but so far there's definitely [a theme of] being honest and being the self I want in my music forever,” says Tugade.\nTugade’s lyrics are a noticeable feature of her songs, and the fact that she writes all of her songs herself reflects her character, according to her friend Josephine Banson ’22. \n“In the song she just released, ‘Honest,’ she talks about being scared of drawing outside the lines and messing up the colors. That's symbolic where I think it also represents her own mindset and how she's trying to step out of the box,” says Banson.\nAlthough she began her career with rap songs, Tugade has since expanded into the indie-pop genre. According to friend Celestine Gonzales ’21, the feelings her songs invoke in others vary widely depending on the song.\n“When she sang at Coffee House, the song was acoustic, so we were all emotional. When she raps in her songs she gets us hyped up. She covers a lot of emotions in her songs,” said Gonzales.\nDrawing from her initial reluctance to share her singing and songwriting talents with others, Tugade wants to encourage aspiring songwriters to take the first step of showing their work to the public.\n“I guess I'd tell my younger self, who didn't want to show her songs to anyone, to just keep practicing and keep writing terrible songs, but [to not be] be afraid to show them to people and get their feedback and improve. Just don't be afraid to start,” said Tugade.\n", "caption": "Cheryl Tugade ’21 not only has experience in songwriting, but also in writing rap stanzas as well.", "credit": "G..HORNSBY/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/arts/cheryl/ghornsby.cheryl.0001.jpg", "headline": "Singer, Rapper, and Songwriter Cheryl Tugade ’21 Signs With Filipino Record Label", "writer": "Joyce Li", "categories": "arts", "more_options": ""}