{"article_content": "Receiving a pass from Alex Fung ’21, Will Godbout ’20 launched the ball towards the bottom-right corner of the goal to help bring the team to 3-1 win over St. Paul’s last Saturday.\nAccording to Godbout, the team’s offensive success is partially the result of Head Coach Edwin Escobar’s emphasis on working as a team in practice, which the team was able to successfully implement in its game on Saturday. Jed Heald ’20 and Alan Fang ’21 also praised the team’s improvement in regards to its ball possession and execution over the season, citing them as key contributors in its success against St. Paul’s.\nFang said, “The team did a really good job controlling the game, moving the ball around and keeping the ball. We have come a long way from where we were at the start of the season. The chemistry was amazing and we all feel like a family. We possess the ball well and we move up and down the pitch together.”\nHeald added, “The team’s ability to capitalize on chances has gotten better over the past few games and we are able to convert even when our chances are limited. Through our last few games, we have been working on controlling the pace of play and constant communication throughout.”\nIn addition to the goal scored by Godbout, the team’s other two goals were both scored by Tade Omoniwa ’21.\nGodbout said, “Tade stood out for sure. He scored two goals, both of which were great goals. Our defense as a whole also played great. Also, [Heald’s] efforts in goal were great.”\nThe team split its two contests this week with a 4-0 loss against High Mowing, moving its record to 4-4-0.\nAccording to Ethan Hong ’22, Godbout was particularly successful in runs down the line, beating many of the opposing defensive players and was able to cross the ball well. The team was challenged by High Mowing’s size and the pressure it put on the ball, according to Co-Captain David Wang ’20.\nWang said, “What was challenging was [that] the other team was a team that liked to pressure the ball quickly. As they had size on us also, it only made it much harder. I hope to improve on our communication and awareness whenever our team had the ball. I learned that we should come into every game with a good mindset, as that is very important.”\nTo ensure the success of its upcoming games, the team needs to work playing quicker and maintaining a high level of confidence, according to Fang.\nFang said, “We can learn to play quicker, we have to believe in ourselves and our teammates and trust each other with the ball. We have to try and keep our cool with the ball instead of sending it up the pitch. We all train extremely hard on a daily basis and we always put 100% into practices no matter how tired we are after school. Soccer means a lot to all of us and we know we have to practice hard to perform well.”\nThe team will face Northfield Mount Hermon at home this Saturday on Smoyer Field.\n", "caption": "Daniel Cho ’21 scored within the first 4 minutes of last week’s game.", "credit": "D. ZHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/10-18/sports/bvs/dzhu.bvs.07 copy.jpg", "headline": "Boys Soccer Evens Record With Win Against St. Paul's, Potentially Positioning Team for Playoffs", "writer": "STAFF REPORT/ Lillie and Gigi with some assistance from Tiffany Li", "categories": "sports,boys-soccer,fall-sports", "more_options": ""}