{"article_content": "Following a scuffle in the five-meter zone, Captain Sam Donchi '20 obtained possession of the ball and fed it to hole-set Max Hunger '20 under the guard of two defensemen. Hunger propelled himself out of the water and flicked the ball with the tips of his fingers over the goalie's head and into the goal, helping advance Andover Boys Water Polo against Phillips Exeter Academy on Wednesday. \nThe team ultimately fell to Exeter 13-12 following five periods of overtime, the final three being sudden death. The team's record now stands at 1-3. \nLast Saturday, Hunger scored a total of eleven goals in Andover's doubleheader against Hopkins and Loomis Chaffee. The team began the weekend with a 15-8 win over Hopkins before falling to Loomis 9-12. According to Henrique Chamon '21, the team has competed well against challenging teams such as Hopkins. \nChamon said, \"[Hopkins] was only our second game of the season so there are definitely some things that we need to work on, but I think overall we played pretty well. There are a few minor errors that we can improve on but I think that's just stuff from not having played in a while.\" \nAccording to Sean Meng '22, the game against Exeter was well-fought and went down to the wire. In the game, the team maintained a lead throughout the first three quarters. However, Exeter ultimately caught up near the end of the fourth quarter and tied the score before the buzzer. Each team competed well on both the offense and the defense and balanced each other out. \n\"It was a pretty tough game [against Exeter] but I think we all played the best that we came and it all came down to luck,\" said Meng. \"We went into [fifth] overtime and at the last second Exeter had a good goal in sudden death.\" \nAccording to Chamon, after the team's initial two games on Saturday, the team worked towards pushing more on its defense to try to prevent the opposing team from getting uncontested shots on goal. \n\"A lot of the teams we have been playing have been cutting back the top people to get on the counter attack for a turnover. We tried to make sure we are following our man even if we are on offense, and just lingering back and making sure the person that is defending us doesn't cut away in case we lose possession of the ball,\" said Chamon.\nIn anticipation of its upcoming games, the team hopes to improve its physical condition and help new players gain a better understanding of the game as a whole, according to Theo Faugeres '21 and Meng.\n\"A lot of people on the team have the physical condition needed to play but lack a little bit of the understanding of the game,\" said Faugeres. \"We need to get the switches done, trying to get people to know when to drop or stay on their defender. We want to get people to instinctively race their arms up after they make a foul and improve their game awareness.\" \n\"We are definitely going to work on conditioning and run more drills to train the newer players and returners so we will all get a better understanding and more practice,\" added Meng.\nAndover Boys Water Polo will next compete on Saturday against both Westminster and Deerfield. \nEditor's Note: Sean Meng and Henrique Chamon are Business Associates for The Phillipian. \n[a][b]\n", "caption": "Because the game went into quintuple overtime, the game against Exeter ended in a sudden death round. ", "credit": "E.ELLSWEIG/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/sports/bvwopo/Compressed_eellsweig.bvwopo.jpg", "headline": "Water Polo Falls in Quintuple Overtime Against Exeter", "writer": "Nicole Lee", "categories": "sports,,featured", "more_options": "--post_date='2019-09-20 14:28:13'"}