{"article_content": "For the past three months, ongoing renovations to Tang Theatre have upgraded its lighting system, overhead rigging, curtains, and sound setup. The electrical wiring inside the walls has also been replaced. According to Bradford Seymour, Instructor and Technical Director of Theatre and Dance, the theater was starting to show signs of age and was in need of a refresh.\n\"The [reason why we began renovations] was that the safety and systems were starting to fail. The sound and lighting systems were patched together and starting to become fairly expensive to maintain... Now, the lighting and sound systems are actually tied in with the emergency building systems. For example, if the fire alarm goes off, if there's audio playing, that cuts out, so people can hear [the alarm], and the lights come on automatically,\" said Seymour. \nThe new renovations will increase the efficiency of the system as a whole. Myles Ringel '21, Tech Crew Member, expressed his appreciation for the convenience that the new features will bring. \n\"Our old curtain was very finicky, it wouldn't go down all the way, so during performances the stage technician would have to run across and pull down all the weights to make sure the audience couldn't see the feet of the actors and technicians as they were changing scenes,\" said Ringel. \nThe renovations are set to be finished before Tang Theatre's first major show of the year, Grasshopper Night. Seymour thinks that the new features will help Grasshopper, in particular, run more smoothly. \n\"For Grasshopper Night, I think it's going to be faster to program. Whoever is working with the lights is going to have more options. They're going to be able to pick color for different scenes in a much better way,\" said Seymour. \"They have millions of different colors.\"\nIn addition to the increase in efficiency, the new system aims to reduce electricity usage and associated costs. The lighting systems changed from an incandescent based infrastructure to a new set of L.E.D. bulbs.\n\"The fixtures were 27 years old and were outdated based on where the technology is, but also using a lot more electricity than they needed to be to get that level of light... We don't need as many lights up in the air because they change color now. They didn't do that before. So we needed to use filters to change the color,\" said Seymour.\nRingel said, \"I'm really excited for the new technology. It's going to be a huge help to the whole space. I think the thing that will make the biggest change is the new array of lights. With the old array of lights, each light could only have one color, and it only has on and off. With these new L.E.D. lights, you have the whole entire R.G.B. spectrum and anywhere in between.\"\n", "caption": "Tang Theatre is used for many large productions throughout the year.", "credit": "J.SHU/The Phillipian", "img_path": "/home/plipdigital/wp-photos/9-20/arts/theatre/theatre.jpg", "headline": "Tang Theatre Receives First Significant Renovation Since 1992", "writer": "staff report", "categories": "arts,featured", "more_options": "--post_date='2019-09-20 14:28:20'"}